In [1]:
from sklearn.gaussian_process import GaussianProcessClassifier
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report
from sklearn.gaussian_process.kernels import RBF
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
from sklearn.decomposition import PCA
from sklearn import preprocessing
import matplotlib.pyplot as plt
from pandas import get_dummies
from sklearn import datasets
from sklearn.svm import SVC
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib
import warnings
import sklearn
import scipy
import numpy
import json
import sys
import csv
import os

In [2]:
print('matplotlib: {}'.format(matplotlib.__version__))
print('sklearn: {}'.format(sklearn.__version__))
print('scipy: {}'.format(scipy.__version__))
print('seaborn: {}'.format(sns.__version__))
print('pandas: {}'.format(pd.__version__))
print('numpy: {}'.format(np.__version__))
print('Python: {}'.format(sys.version))

matplotlib: 3.0.2
sklearn: 0.20.1
scipy: 1.1.0
seaborn: 0.9.0
pandas: 0.23.4
numpy: 1.15.4
Python: 3.7.1 (default, Dec 14 2018, 19:28:38)
[GCC 7.3.0]

In [3]:
mylist = [1, 2, 3]
x = np.array(mylist)
x

array([1, 2, 3])

In [4]:
y = np.array([4, 5, 6])
y

array([4, 5, 6])

In [5]:
m = np.array([[7, 8, 9], [10, 11, 12]])
m

array([[ 7,  8,  9],
       [10, 11, 12]])

In [6]:
m.shape

(2, 3)

In [7]:
n = np.arange(0, 30, 2)
n

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28])

In [8]:
n.reshape(5, 3)

array([[ 0,  2,  4],
       [ 6,  8, 10],
       [12, 14, 16],
       [18, 20, 22],
       [24, 26, 28]])

In [9]:
o = np.linspace(0,4,9)
o

array([0. , 0.5, 1. , 1.5, 2. , 2.5, 3. , 3.5, 4. ])

In [10]:
o.resize(3,3)
o

array([[0. , 0.5, 1. ],
       [1.5, 2. , 2.5],
       [3. , 3.5, 4. ]])

In [11]:
np.ones((3,4))

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [12]:
np.zeros((3, 4))

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [13]:
np.eye((4))

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [14]:
np.diag((y))

array([[4, 0, 0],
       [0, 5, 0],
       [0, 0, 6]])

In [15]:
np.array([1,2,3]*3)

array([1, 2, 3, 1, 2, 3, 1, 2, 3])

In [16]:
np.repeat([1,2,3],3)

array([1, 1, 1, 2, 2, 2, 3, 3, 3])

# 2-2 Numpy:Combining Arrays

In [17]:
p = np.ones([2,3],int) 
p

array([[1, 1, 1],
       [1, 1, 1]])

In [18]:
np.vstack([p, 2*p])

array([[1, 1, 1],
       [1, 1, 1],
       [2, 2, 2],
       [2, 2, 2]])

In [19]:
np.hstack([p, 2*p])

array([[1, 1, 1, 2, 2, 2],
       [1, 1, 1, 2, 2, 2]])

## Numpy:OperationsÂ¶

In [20]:
print(x + y) # elementwise addition     [1 2 3] + [4 5 6] = [5  7  9]
print(x - y) # elementwise subtraction  [1 2 3] - [4 5 6] = [-3 -3 -3]

[5 7 9]
[-3 -3 -3]

In [21]:
print(x * y) # elementwise multiplication  [1 2 3] * [4 5 6] = [4  10  18]
print(x / y) # elementwise divison         [1 2 3] / [4 5 6] = [0.25  0.4  0.5]

[ 4 10 18]
[0.25 0.4  0.5 ]

In [22]:
print(x**2) # elementwise power  [1 2 3] ^2 =  [1 4 9]

[1 4 9]

In [23]:
x.dot(y) # dot product  1*4 + 2*5 + 3*6

32

In [24]:
z = np.array([y, y**2])
z

array([[ 4,  5,  6],
       [16, 25, 36]])

In [25]:
len(z)

2

In [26]:
z.shape

(2, 3)

In [27]:
z.T

array([[ 4, 16],
       [ 5, 25],
       [ 6, 36]])

In [28]:
z.T.shape

(3, 2)

In [29]:
z.dtype

dtype('int64')

In [30]:
type(z)

numpy.ndarray

In [31]:
z = z.astype('f')
z

array([[ 4.,  5.,  6.],
       [16., 25., 36.]], dtype=float32)

In [32]:
z.dtype

dtype('float32')

#  Numpy: Math Functions

In [33]:
a = np.array([-4, -2, 1, 3, 5])

In [34]:
a.sum()

3

In [35]:
a.max()

5

In [36]:
a.min()

-4

In [37]:
a.mean()

0.6

In [38]:
a.std()

3.2619012860600183

In [39]:
b = [-1,2,3]
b

[-1, 2, 3]

In [40]:
[abs(x) for x in b]

[1, 2, 3]

In [41]:
a.argmax()

4

In [42]:
a.argmin()

0

## Numpy:Indexing / Slicing

In [43]:
s = np.arange(13)**2
s

array([  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100, 121, 144])

In [44]:
s[0], s[4], s[-1]

(0, 16, 144)

In [45]:
s[1:5]

array([ 1,  4,  9, 16])

In [46]:
s[-4:]

array([ 81, 100, 121, 144])

In [47]:
s[-5::-2]

array([64, 36, 16,  4,  0])

In [48]:
s[-5::2]

array([ 64, 100, 144])

In [49]:
r = np.arange(36)
r.resize((6, 6))
r

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35]])

In [50]:
r[2, 2]

14

In [51]:
r[3, 3:6]

array([21, 22, 23])

In [52]:
r[:2, :-1]

array([[ 0,  1,  2,  3,  4],
       [ 6,  7,  8,  9, 10]])

In [53]:
r[-1, ::2]

array([30, 32, 34])

In [54]:
r[:, ::4]

array([[ 0,  4],
       [ 6, 10],
       [12, 16],
       [18, 22],
       [24, 28],
       [30, 34]])

In [55]:
r[r > 30]

array([31, 32, 33, 34, 35])

In [56]:
r[r % 2 == 0]

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32,
       34])

In [57]:
r[r > 30] = 30
r

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29],
       [30, 30, 30, 30, 30, 30]])

In [58]:
r[r % 2 != 0] = 0
r

array([[ 0,  0,  2,  0,  4,  0],
       [ 6,  0,  8,  0, 10,  0],
       [12,  0, 14,  0, 16,  0],
       [18,  0, 20,  0, 22,  0],
       [24,  0, 26,  0, 28,  0],
       [30, 30, 30, 30, 30, 30]])

##  Numpy :Copying DataÂ¶

In [59]:
r2 = r[:3,:3]
r2

array([[ 0,  0,  2],
       [ 6,  0,  8],
       [12,  0, 14]])

In [60]:
r2[:] = 0
r2

array([[0, 0, 0],
       [0, 0, 0],
       [0, 0, 0]])

In [61]:
r          #r` has also been changed!

array([[ 0,  0,  0,  0,  4,  0],
       [ 0,  0,  0,  0, 10,  0],
       [ 0,  0,  0,  0, 16,  0],
       [18,  0, 20,  0, 22,  0],
       [24,  0, 26,  0, 28,  0],
       [30, 30, 30, 30, 30, 30]])

In [62]:
r_copy = r.copy()
r_copy

array([[ 0,  0,  0,  0,  4,  0],
       [ 0,  0,  0,  0, 10,  0],
       [ 0,  0,  0,  0, 16,  0],
       [18,  0, 20,  0, 22,  0],
       [24,  0, 26,  0, 28,  0],
       [30, 30, 30, 30, 30, 30]])

In [63]:
r_copy = r[:]
r_copy

array([[ 0,  0,  0,  0,  4,  0],
       [ 0,  0,  0,  0, 10,  0],
       [ 0,  0,  0,  0, 16,  0],
       [18,  0, 20,  0, 22,  0],
       [24,  0, 26,  0, 28,  0],
       [30, 30, 30, 30, 30, 30]])

In [64]:
r_copy[:] = 10
print(r_copy, '\n')
print(r)

[[10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]]

[[10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]
 [10 10 10 10 10 10]]

# Numpy: Iterating Over ArraysÂ¶

In [65]:
test = np.random.randint(0,10,(4,3))
test

array([[4, 5, 3],
       [9, 7, 7],
       [7, 3, 1],
       [0, 6, 9]])

In [66]:
for row in test:
    print(row)

[4 5 3]
[9 7 7]
[7 3 1]
[0 6 9]

In [67]:
for i in range(len(test)):
    print(test[i])

[4 5 3]
[9 7 7]
[7 3 1]
[0 6 9]

In [68]:
for i, row in enumerate(test):      #Iterate by row and index:
    print('row', i, 'is', row)

row 0 is [4 5 3]
row 1 is [9 7 7]
row 2 is [7 3 1]
row 3 is [0 6 9]

In [69]:
test2 = test**2
test2

array([[16, 25,  9],
       [81, 49, 49],
       [49,  9,  1],
       [ 0, 36, 81]])

In [70]:
for i, j in zip(test, test2):   # Use `zip` to iterate over multiple iterables.
    print(i,'+',j,'=',i+j)

[4 5 3] + [16 25  9] = [20 30 12]
[9 7 7] + [81 49 49] = [90 56 56]
[7 3 1] + [49  9  1] = [56 12  2]
[0 6 9] + [ 0 36 81] = [ 0 42 90]

## Numpy: The Series Data StructureÂ¶

In [71]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [72]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [73]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [74]:
np.nan == None

False

In [75]:
np.isnan(np.nan)

True

In [76]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [77]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [78]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [79]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

#  Numpy: Querying a Series

In [80]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [81]:
s.iloc[3]

'South Korea'

In [82]:
s.loc['Taekwondo']

'South Korea'

In [83]:
s[3]

'South Korea'

In [84]:
s['Taekwondo']

'South Korea'

In [85]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [86]:
s.iloc[2]                   # Q why is s[2] not locking

'Japan'

In [87]:
s.loc[100]

'Scotland'

In [88]:
s[100]

'Scotland'

In [89]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [90]:
total = 0
for item in s:
    total += item
print(total)

324.0

In [91]:
total = np.sum(s)
print(total)

324.0

In [92]:
m=np.random.randint(0,1000,10000)

In [93]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()

0    998
1     16
2    157
3    104
4    766
dtype: int64

In [94]:
len(s)

10000

In [95]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

1.09 ms Â± 17 Âµs per loop (mean Â± std. dev. of 7 runs, 100 loops each)

In [96]:
%%timeit -n 100
summary = np.sum(s)

206 Âµs Â± 28.6 Âµs per loop (mean Â± std. dev. of 7 runs, 100 loops each)

In [97]:
s += 2
s.head()

0    1000
1      18
2     159
3     106
4     768
dtype: int64

In [98]:
for label, value in s.iteritems():
    s.set_value(label, value+2)
s.head()

/home/kadas/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

0    1002
1      20
2     161
3     108
4     770
dtype: int64

In [99]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,100))
for label, value in s.iteritems():
    s.loc[label]= value+2

15.8 ms Â± 623 Âµs per loop (mean Â± std. dev. of 7 runs, 10 loops each)

In [100]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,100))
s+=2

289 Âµs Â± 14.1 Âµs per loop (mean Â± std. dev. of 7 runs, 10 loops each)

In [101]:
%%timeit -n 100
q = pd.Series(np.random.randint(0,1000,10000))
total = 0
for item in q:
    total += item

1.27 ms Â± 20.4 Âµs per loop (mean Â± std. dev. of 7 runs, 100 loops each)

In [102]:
s = pd.Series([1, 2, 3])
s.loc['Animals'] = 'bears'
s

0              1
1              2
2              3
Animals    bears
dtype: object

In [103]:
original_sports = pd.Series({'Archery': 'Bhutan',
                   'Golf': 'Scotland',
                   'Sumo': 'Japan',
                   'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'],
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [104]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [105]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [106]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [107]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [108]:
all_countries['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

# Numphy Distributions

In [109]:
np.random.binomial(10,0.5)

7

In [110]:
np.random.binomial(1,0.5)

1

In [111]:
np.random.binomial(10,0.5)/10

0.3

In [112]:
np.random.binomial(1000, 0.5)/1000

0.505

In [113]:
chance_of_tornado = 0.01/100
np.random.binomial(100000, chance_of_tornado)

8

In [114]:
chance_of_tornado = 0.01

tornado_events = np.random.binomial(1, chance_of_tornado, 1000000)
tornado_events

array([0, 0, 0, ..., 0, 0, 0])

In [115]:
len(tornado_events)

1000000

In [116]:
np.random.binomial(1,0.01)

0

In [117]:
chance_of_tornado = 0.01

tornado_events = np.random.binomial(1, chance_of_tornado,1000000)

two_days_in_a_row = 0
for j in range(1, len(tornado_events)-1):
    if tornado_events[j] == 1 and tornado_events[j-1] == 1:
        two_days_in_a_row +=1
print('{} tornadoes back to back in {} years'.format(two_days_in_a_row,1000000/365))

104 tornadoes back to back in 2739.72602739726 years

In [118]:
np.random.uniform(0, 1)

0.2996416571252407

In [119]:
np.random.normal(0.75)                 #what if we have both

0.8788848091767281

In [120]:
distribution = np.random.normal(0.75,size=1000)
distribution

array([-7.86351964e-01,  5.84785514e-01,  1.81587773e+00,  3.08796889e+00,
        8.32630208e-01, -1.32907208e-01, -6.19005692e-01,  1.67626227e+00,
        2.39827678e-01,  1.21852837e-01, -2.40071104e-01, -6.61239612e-02,
        2.00778961e+00,  2.17448198e-02,  2.34577130e+00,  2.70873321e-02,
        8.70539773e-01,  6.27202110e-02,  1.44767370e+00, -1.14699893e-01,
        6.61754358e-01,  4.29086520e-01,  3.51228503e-01,  1.96789701e+00,
        9.80436758e-01, -2.47113653e-01,  3.14476554e-01, -1.48015546e+00,
       -2.66983499e-01,  3.14137899e+00,  2.10524373e+00,  7.62222009e-01,
        2.25446967e+00,  1.06111052e+00,  2.57143775e+00,  2.33725876e-01,
        1.32463019e+00,  7.04994883e-01,  5.60914329e-02,  9.68031800e-01,
        1.29375063e-01,  1.20772769e+00,  5.62986031e-01,  1.27988207e+00,
       -4.86537290e-01,  8.21400923e-01,  8.42790839e-01, -7.85826973e-02,
       -2.51811443e-01,  6.28188311e-01,  1.25550453e+00,  1.09085028e+00,
        2.67139562e-01, -6.29590065e-01,  1.87794203e+00,  2.20092286e+00,
        4.97719858e-01,  1.23403791e+00,  4.82767937e-02,  1.04500704e+00,
        9.87743574e-01,  1.47103632e+00,  1.23970631e+00,  1.37825031e+00,
        1.58708534e+00, -4.18930145e-01, -5.62340526e-01, -2.09127845e-01,
        2.67550949e-01,  1.84010558e+00,  1.26525373e+00,  2.77077521e+00,
        9.62041934e-01,  8.18961776e-01,  2.56298842e+00, -8.86904633e-01,
        1.69615160e+00,  8.82803138e-01,  2.24615071e+00, -1.42476193e+00,
        1.05655531e+00,  3.12296248e-01,  2.27403487e+00,  8.50462705e-01,
        7.25267694e-01,  7.35972554e-01,  3.10167580e+00,  1.62486513e+00,
        1.70299094e+00,  1.03710390e+00,  5.23181905e-01,  2.52657433e+00,
       -1.65648165e-01,  1.58695911e+00,  9.28790848e-01,  1.53773799e+00,
        1.61687424e+00,  1.41803041e+00,  5.92339131e-01,  1.18978371e+00,
        8.93993144e-01,  1.84021192e-01,  1.58688386e-01,  1.17230659e+00,
        1.14545953e+00,  1.26075502e+00,  1.70643017e+00, -1.25011323e+00,
        1.68161184e+00,  7.48422412e-01,  1.53437365e+00,  1.45481649e+00,
        1.67055009e+00,  5.59090119e-01,  8.12481444e-01,  2.60978557e+00,
        2.46358878e-01,  1.12715284e+00,  3.01359535e-01,  1.36796349e+00,
        1.76701109e+00,  3.03016322e+00, -3.32762672e-01,  1.25726523e+00,
        1.66430912e+00, -1.43667883e+00,  7.34520628e-01,  9.80487658e-01,
        1.40942741e+00,  2.12350079e+00,  1.29895132e+00,  1.17035030e+00,
        1.49969746e+00,  3.13321985e-02,  1.52047445e+00,  1.28833807e+00,
        1.25449351e+00, -6.84147765e-01, -6.99147418e-01, -8.86148683e-02,
        3.91242785e-01, -1.75898887e-01,  1.19682470e+00,  1.18403427e+00,
        7.35905360e-01,  1.27877598e-01,  8.77405277e-01,  4.75652775e-01,
        4.11278464e-01,  7.98544190e-01,  1.82704559e+00,  1.76883291e+00,
       -5.40827200e-01,  1.06594012e+00,  2.07564314e+00,  6.76286290e-01,
        1.29654550e+00,  2.33379942e+00,  1.96045608e+00, -8.82764572e-01,
       -2.78450172e-01,  5.02540109e-02, -3.11390397e-01, -1.07869948e-01,
        1.79522572e+00,  5.88279997e-01,  1.94306254e+00,  7.19365881e-01,
        1.55316054e+00,  1.34370802e+00,  1.08817288e+00, -3.94761639e-01,
        4.14904852e-02,  1.34909809e+00,  7.71558296e-02,  2.64351878e-01,
        2.15466375e+00, -5.04438575e-01,  3.37850378e-02,  8.63385186e-01,
        5.95292067e-01,  2.07563494e+00, -7.31061533e-01, -1.04390519e+00,
       -2.68736477e-01,  9.31349142e-01,  1.51249958e+00,  8.11862106e-01,
        9.84183610e-02, -2.01984574e-01,  2.08811836e+00,  8.68571632e-01,
        4.58473053e-01, -6.31412583e-01,  1.16317310e+00,  1.04662488e+00,
        6.48703685e-01,  4.89138052e-02,  1.39907117e+00,  3.68908281e-01,
        2.42584603e+00,  1.41201726e+00,  8.69655751e-01,  2.45520473e+00,
        2.23906788e+00,  4.39255546e-01,  2.14966166e+00, -5.54375802e-01,
        1.70002261e+00, -1.33252095e+00,  1.26124050e+00,  1.86241362e+00,
        2.45236199e+00, -1.68095592e+00,  1.02588958e+00,  1.46626803e+00,
        2.12581041e+00,  1.63814793e+00, -9.87249163e-01,  1.60714739e+00,
        6.81384147e-02,  1.35910751e+00, -1.08278696e+00, -6.00711861e-01,
       -5.30902902e-01,  4.44036428e-01,  2.07399291e-01,  1.99523226e+00,
        8.24952120e-01, -4.91930729e-01,  5.14364568e-01,  1.16320531e+00,
        4.36648752e-01,  3.76802185e-01,  4.56525751e-01, -1.84464810e-01,
        7.41355325e-01,  2.22937634e+00,  1.54450777e+00, -1.14945269e+00,
        6.21845922e-01,  1.62177265e+00, -1.49418754e-02, -1.71666016e-01,
        2.05233016e-02,  1.14784026e+00,  1.24740355e+00,  1.06948151e+00,
        2.78316219e+00, -1.77273594e-02, -4.66741809e-01,  2.87103185e-01,
        3.42350070e-01,  2.08079556e+00, -5.29241472e-01,  1.21475319e+00,
        1.47264371e+00,  2.65319362e+00,  7.00431406e-01, -6.68649697e-01,
        2.72878526e+00,  1.08310616e-01, -5.21782248e-01,  3.22157505e-01,
        1.84261989e+00,  6.08007047e-01,  1.36322653e+00,  6.01991325e-02,
        6.58122812e-01, -5.11906936e-01,  5.93230557e-02,  1.27363738e+00,
        2.25582952e+00, -1.46023901e+00,  1.49621750e+00,  2.22682655e+00,
       -8.43338528e-02, -3.93672641e-01,  1.96540017e+00,  1.39379066e+00,
        1.82564747e+00,  8.31560547e-01, -6.32243406e-01, -9.37755479e-01,
        1.52419213e+00,  4.26408649e-01,  2.47398807e+00,  2.80906905e-02,
       -6.31778906e-01,  1.52664246e+00, -8.02512677e-01, -1.06830894e+00,
        2.37064111e+00,  5.53815496e-01,  1.06715835e+00,  3.89926155e-01,
        1.93470090e-01,  1.49412300e+00,  1.40427215e+00,  7.61985064e-01,
        1.80051579e+00,  8.19441267e-02,  4.50045502e-01,  4.01389459e-03,
        5.28906697e-01,  1.07848407e+00, -1.91149672e-01, -4.38820523e-01,
        1.68144301e+00,  2.52819048e+00,  2.96392849e-01,  2.33080123e-01,
       -2.01389449e-01,  1.30436893e+00,  2.12092450e+00,  2.55992109e+00,
        8.00261919e-01,  1.28166521e+00,  3.90798795e-01,  1.59874373e-01,
        1.32429437e+00,  1.62602654e+00,  1.11955966e+00,  5.17483929e-01,
        1.14493618e+00, -9.40250824e-01,  4.59330564e-01, -4.19854637e-01,
        2.54465377e+00,  1.42013258e+00, -7.88301261e-01,  1.14694226e+00,
        1.00013481e+00,  1.52286942e-02,  2.50640170e+00,  1.37796193e-01,
        4.35098081e-01,  5.32934472e-01,  7.66128175e-01,  1.75996275e+00,
       -5.59447224e-01,  1.90688133e+00,  7.61468752e-01,  3.77660663e-01,
        8.30633208e-01,  2.56741081e+00,  1.76908363e+00,  9.03609986e-01,
       -4.61038737e-01,  1.18293316e+00,  1.16854264e+00, -7.86692643e-01,
        1.21719190e+00,  8.04367083e-01,  5.52067203e-01,  6.38379324e-01,
        5.53371981e-01, -1.71433547e+00, -2.62423405e-01,  2.58209555e+00,
        6.44611231e-01,  1.40135334e+00,  6.79973676e-01,  1.88351797e+00,
        1.29943043e+00,  1.13200009e-01,  1.92308092e+00,  2.48989373e+00,
        8.77547018e-02,  3.14804283e-01,  2.46923253e-01,  1.33377965e+00,
        1.46807292e+00,  2.46145887e+00,  9.23810148e-01, -4.06008772e-01,
        5.54486670e-01,  8.82658062e-01,  1.70389912e-01,  2.57292659e+00,
        2.34995476e-01,  6.39585288e-01,  3.24716088e-01, -7.70882691e-02,
       -1.36583212e-01,  1.45798771e+00,  5.17987602e-01,  1.98549421e+00,
        2.31705798e+00,  8.56996153e-01,  2.53761959e+00,  3.01362884e-01,
        8.25194974e-01,  1.85168272e+00, -5.67055284e-01, -8.39483400e-02,
        2.15766312e+00,  1.30718273e+00,  1.95278660e+00,  1.78598668e+00,
        3.69914620e-01, -5.83642440e-01,  1.01740662e+00, -1.64239140e-02,
        2.08355575e+00,  3.23144799e-01,  1.50603206e+00,  1.95344332e+00,
        3.44685888e-01,  3.37641258e-01,  3.67509020e-01, -2.03739430e-01,
        1.06902437e+00,  1.34271235e+00,  1.07558685e+00, -5.58286070e-01,
        1.32337687e+00,  1.13178880e+00,  1.37868292e-01,  1.07835856e+00,
       -1.08346253e+00,  3.60888036e-01,  4.54742217e-01,  6.65770698e-01,
        2.36575357e+00, -3.42862307e-01, -4.89031026e-02, -4.30350373e-01,
        8.99185713e-01,  1.43348063e+00,  7.91264637e-01,  1.23857097e+00,
        8.15844327e-01,  7.92883905e-01,  2.82836684e-01,  1.16670526e+00,
        1.38275126e+00, -1.70014699e+00,  1.17307854e+00,  1.48940672e+00,
        4.17750685e+00,  6.04071173e-01,  2.34964901e+00,  7.25215242e-01,
        7.73659083e-01,  7.38003114e-02,  1.20399719e+00,  1.20805432e+00,
       -4.30975549e-01,  9.46007001e-01,  1.18528914e+00,  6.39593949e-01,
        2.07207151e+00,  2.43739053e-01,  8.72332841e-01, -1.65710443e-01,
       -6.48025877e-01, -9.26034741e-01,  1.01531137e+00, -8.37350940e-01,
       -9.28733317e-01,  6.82750017e-01,  1.02500236e+00,  8.02992438e-01,
       -5.27956483e-01,  2.89314188e+00, -1.08696795e+00,  5.11080261e-01,
        2.91414171e+00,  1.02901980e+00,  1.29550209e+00,  1.54225873e+00,
        9.82987110e-01,  2.44819000e+00,  4.04905152e-01,  2.19039672e+00,
        1.41316235e-01,  4.16932647e-01,  9.58276829e-01,  1.41366885e-01,
        1.96453857e+00,  1.39982141e+00,  1.25419856e+00,  1.69331722e+00,
        1.29735391e+00, -5.85433512e-01,  1.99209625e-01,  5.03460077e-02,
        3.49037986e-01,  8.89387910e-01, -1.18232989e+00, -2.29783150e+00,
        1.11175458e+00, -3.95125384e-01,  9.36281572e-01,  5.76107818e-01,
        1.43618533e-02,  7.37402971e-02, -1.10401594e+00,  1.93807947e-01,
        1.11598470e+00,  1.00339336e+00, -1.56840848e+00,  3.17568311e+00,
        1.44890965e+00,  1.65631981e+00, -2.48810773e-02,  8.65065087e-01,
       -7.90120285e-01,  8.42106216e-01, -4.70045198e-01,  1.72163653e+00,
        9.53239575e-01,  1.43903408e+00,  9.42614549e-01, -3.95813729e-01,
        5.94874210e-01,  1.35305605e-01,  9.14623804e-01,  9.00846981e-01,
        7.29213466e-01,  1.16306258e+00,  7.45230840e-01,  1.80631560e+00,
        9.18207943e-01,  7.48837788e-01,  6.09428040e-01,  1.12059641e+00,
       -1.12234673e-02,  1.40402403e+00,  6.96569916e-01,  8.84139158e-01,
       -1.06556495e+00,  1.69409400e-01,  6.70705836e-01,  7.95955543e-01,
        1.02797851e+00,  3.51967816e-02,  1.57327025e+00,  4.07480063e-01,
        1.17868434e+00,  1.69578739e+00,  2.18344372e+00, -8.87485144e-02,
        1.93082106e+00,  9.99260807e-01,  3.89465887e-01,  3.73049392e-02,
        3.59351612e+00,  1.19476789e+00, -1.56287880e+00,  1.27766623e+00,
        2.35346749e+00,  2.17029854e+00,  6.25222067e-01,  9.40102235e-01,
        1.22067645e+00,  1.21119086e+00,  3.75836905e-01,  1.45493344e+00,
        1.25802645e-01, -6.44132526e-02,  1.94093807e+00,  1.27589028e+00,
       -4.90672162e-01, -4.75530420e-01, -2.26868725e-01,  1.07381275e+00,
        1.04142755e+00,  9.01454791e-01,  1.82990512e+00,  2.95014134e+00,
        8.29733943e-02,  1.93608103e+00,  7.21166136e-02,  1.08037602e+00,
        1.76649375e+00,  2.23099430e+00,  1.39955603e+00,  1.66156870e+00,
       -6.90997811e-01,  1.02936617e+00, -3.69532007e-01,  6.23824188e-01,
        1.34036256e+00,  2.75898502e+00,  5.92999411e-01, -1.83977271e-01,
       -8.20539722e-02, -1.88432703e+00,  1.91573140e-01,  1.89398353e+00,
        4.37120837e-01,  1.21913043e+00, -8.11855152e-02, -8.72289886e-01,
        1.82430582e+00,  8.49838116e-01, -8.29963296e-01,  9.06087177e-01,
        6.49770901e-01,  2.26533949e-01, -8.12121752e-01,  2.04686030e+00,
        1.62134306e+00,  2.06326080e+00,  2.89023031e+00,  7.11123082e-02,
       -6.13599946e-02,  1.74136058e+00,  3.78403326e-01,  1.35442570e+00,
        1.45699556e+00, -1.41296498e+00,  6.80864166e-01,  1.89560447e+00,
       -2.79329488e-01,  1.09376661e+00, -2.58926977e-02,  1.21927777e+00,
       -3.13112315e-01,  2.69091638e+00,  1.63676081e-01,  1.28766799e-01,
        1.71408647e+00,  1.43462177e+00,  1.05633038e-01,  2.96871332e-01,
        5.57073998e-01,  1.05983599e+00,  6.61726150e-01,  5.84757756e-01,
        5.39019245e-01,  8.05082961e-01,  6.56524709e-01,  2.27624454e-01,
        1.89991046e+00,  1.61116157e-01,  2.00520605e+00,  1.34587367e+00,
        1.23617140e+00, -3.94547081e-01,  2.98829065e-01,  9.96620876e-01,
        4.89839914e-01, -8.28735000e-02,  1.46618818e+00,  1.36200344e+00,
        6.73886061e-01,  6.81039097e-01,  1.64317579e+00, -2.88773588e-01,
        1.08788043e+00, -2.79675647e-01, -1.63413464e-01,  2.96173203e-01,
       -8.12304428e-01, -4.99845607e-01,  1.34347457e+00,  1.35646985e+00,
        9.75336086e-01,  2.53204481e+00,  9.18804090e-01,  1.98649568e+00,
       -4.38862461e-01,  4.86949531e-01, -4.74162675e-01,  1.55348209e+00,
        1.74723649e+00,  2.88945464e-01,  7.78605382e-01,  2.96339787e-01,
        1.97166581e+00,  6.87225733e-01,  1.12638091e+00,  1.33650794e+00,
       -8.77988756e-01, -5.64584250e-01,  2.86725785e-01,  8.84500130e-01,
       -9.89715515e-01, -2.74236644e-02, -4.42343931e-02,  1.37003259e+00,
       -9.49559658e-01,  6.64561999e-01,  1.38675336e+00,  1.98323537e+00,
       -2.34602166e-01,  8.17989094e-01,  1.82959412e-01,  7.53195748e-01,
       -2.01649198e-01,  8.13882650e-01,  1.10917876e+00,  1.51158687e+00,
        1.14749136e+00,  1.11162688e-01,  2.26847432e+00,  1.39054171e+00,
        1.75265102e+00,  1.45429030e+00,  1.94389092e+00, -5.93218967e-01,
        1.39339720e+00,  1.08116705e+00,  7.77994998e-01,  4.33361862e-01,
        1.68435709e+00,  1.01690453e+00,  1.61548463e+00,  2.60369907e+00,
       -9.39489113e-01,  1.44195955e+00,  9.97533792e-02,  1.80364862e+00,
        9.38175684e-03,  6.40624968e-01,  1.63611514e-02, -1.29913845e+00,
       -3.19298851e-01,  4.98689304e-01,  1.61713427e+00, -1.45948632e-01,
        5.43684380e-01,  1.46995310e+00,  4.88637953e-01,  7.16549466e-01,
        1.24961518e+00,  3.94441632e-01,  1.88098372e+00,  5.54736364e-01,
        9.81044718e-01,  1.58948412e+00, -1.72062540e+00,  5.10528235e-01,
        2.55484583e+00,  8.06938200e-01,  8.91758036e-01,  3.63436496e-01,
        6.92062297e-01, -1.84243493e+00,  4.22972940e-01,  2.09975900e-01,
       -2.24881625e-01,  2.60002600e+00,  9.41888452e-02,  2.36556590e-01,
       -1.88969158e-01,  4.58117251e-01,  1.69231750e+00,  2.51805388e-01,
        1.53624121e+00,  4.71069710e-01, -1.62161612e-01, -6.27145598e-01,
        1.40703235e+00,  1.18616100e-01,  5.12473979e-01,  9.13216048e-01,
        2.44705425e+00,  5.62963108e-01, -1.12419134e+00,  2.59595183e-01,
        2.05635860e+00,  3.76331142e-01,  1.56189338e+00, -3.41714441e-01,
        2.66686098e-01,  1.51600962e+00,  2.12352088e+00,  3.46594083e-01,
        1.71542997e+00,  4.53653891e-01, -1.17637784e-01,  4.28184296e-01,
        1.89488088e+00,  9.38776938e-01,  7.35580975e-01, -2.02947231e-01,
       -6.37739492e-01,  8.12154767e-01,  1.82583763e+00, -4.23385664e-01,
       -1.27096706e+00,  4.62920643e-01,  1.35060459e+00,  1.45883625e+00,
        1.12573281e+00, -7.38923944e-01,  2.47758608e+00,  1.17675453e+00,
       -1.40179130e+00, -2.05132161e-01,  2.11457229e+00,  1.83503021e+00,
        2.16755876e-01, -2.49558561e-02,  7.32229377e-01,  2.25162751e+00,
        2.62028133e+00, -8.25272679e-01,  2.93339329e-02, -2.25749236e-01,
       -3.15856279e-01, -1.00776337e-01,  1.73658970e+00, -1.33733164e-02,
        4.62545758e-01, -1.59161459e+00,  1.39866096e+00,  1.42890146e+00,
        1.69142003e+00,  1.58692280e+00,  6.87077263e-01, -4.87831374e-01,
       -1.96361400e-01,  9.83906311e-01,  1.33152539e+00,  7.12055470e-01,
        1.40216820e+00,  1.50932006e+00,  1.49834284e+00,  8.29794723e-01,
       -1.14769325e+00,  3.62237451e-01, -8.38078197e-01,  2.24170463e+00,
       -2.90185838e-01,  1.71202274e+00,  3.88142992e-01, -1.51028570e-01,
        2.14209438e+00,  3.76635042e-01,  1.73496746e+00,  6.56850000e-03,
       -3.02085784e-01, -5.02647251e-01,  4.10490992e-01,  1.03372366e+00,
       -9.55456355e-01, -2.95905065e-01,  1.57403009e+00, -3.03775841e-01,
       -8.84067372e-01,  2.02330963e+00, -2.03674534e-02,  1.61043512e-01,
        1.52213621e+00,  1.48033526e-01, -8.37262077e-01,  1.65201442e+00,
        2.66480280e-01, -1.07275536e+00,  9.90132558e-01,  7.40394718e-01,
       -6.17303169e-02,  1.68392983e+00,  1.80317249e+00, -5.49737101e-01,
       -2.34111376e-01,  9.14169878e-01,  1.50444221e+00,  3.94531967e-01,
        1.01516959e+00, -6.88998705e-01,  6.88891261e-02, -5.51478413e-01,
        7.83747486e-01, -7.48875625e-01,  1.82350791e+00, -4.21274067e-01,
        1.44175088e+00,  1.71498873e-01,  1.97991943e+00, -1.45582437e-02,
       -3.25116869e-01,  1.27337453e+00,  7.06725840e-01,  1.85951881e+00,
        6.27841974e-01,  1.27281100e+00,  4.29524839e-01,  2.97972256e-01,
        1.06002745e+00,  2.17892323e+00,  2.39572643e+00,  2.66270716e+00,
        2.04454259e+00, -8.30931851e-01,  3.23607124e+00,  1.55255593e+00,
        1.34399236e+00, -9.55730801e-02,  2.47345692e+00, -4.96309497e-01,
        6.94855985e-01, -3.13733776e-02,  9.32303424e-01,  1.13445777e+00,
       -6.43918606e-01, -1.01101829e+00,  1.15753413e+00,  5.58987349e-01,
        3.95493459e-01,  8.20191091e-01,  2.11958319e+00,  1.60733500e+00,
       -1.82008856e-02, -9.36649965e-01,  1.30264848e+00,  2.57293384e+00,
        2.90862554e+00, -8.28283575e-01,  3.03605586e-01,  2.23560222e-01,
       -2.07845459e-01,  1.20588355e+00,  1.09621495e+00, -1.41949637e-01,
        1.33237198e+00,  1.99206769e+00, -4.41907525e-01,  4.84092882e-01,
        2.05756288e+00,  2.26547153e-01, -1.01569654e+00,  1.24927153e+00,
        1.61104195e+00,  5.96807468e-01,  1.31587681e+00, -9.68701871e-01,
        7.17958513e-01, -8.55390141e-02,  5.60355594e-01,  6.89105823e-01,
        1.23741970e+00,  1.23198098e+00,  1.19632335e+00,  1.09426544e+00,
       -3.16771394e-02,  6.06628113e-01,  1.87342455e+00, -4.77495287e-01,
        5.04769635e-01,  6.09737077e-01,  2.56240811e+00, -8.22903092e-01,
        2.97353019e-02,  2.87749007e-01,  1.30579340e+00,  2.09692347e+00,
        1.51126766e-01,  4.13466432e-01, -5.86546664e-01,  8.32948697e-01,
        4.71225769e-01,  7.03331158e-01,  1.18079923e+00,  8.04282805e-01,
        1.32727708e+00,  1.79270334e+00,  1.06386134e+00,  1.12612512e+00,
        3.60349109e-02,  1.08785246e-01,  2.93453492e-01, -8.27990263e-02,
        5.90205779e-01, -1.05721375e+00,  1.54636992e+00, -6.18504360e-02,
        7.08835132e-01,  1.64043773e+00, -3.42631011e-01, -6.60585726e-01,
        2.24631168e-01, -1.04200329e+00,  1.67268704e+00,  7.14414301e-01,
        1.64743082e+00,  1.78502311e+00,  9.00506790e-01,  2.46983333e+00,
        7.50122706e-01,  1.07298322e+00,  9.53740794e-01,  2.04119797e-02,
        5.00111080e-01,  7.68872088e-01,  1.08036559e+00,  7.94417119e-01,
       -2.07355322e-01,  1.11605633e+00,  1.94205059e+00,  9.33832315e-01,
        1.58277098e+00,  2.34559589e-01, -3.79732565e-01,  1.82177446e+00])

In [121]:
np.sqrt(np.sum((np.mean(distribution)-distribution)**2)/len(distribution))

0.9801942498836381

In [122]:
np.sqrt(25)

5.0

In [123]:
np.mean(distribution)

0.7512879518615868

In [124]:
np.mean(distribution)-distribution

array([ 1.53763992e+00,  1.66502438e-01, -1.06458978e+00, -2.33668094e+00,
       -8.13422566e-02,  8.84195160e-01,  1.37029364e+00, -9.24974320e-01,
        5.11460273e-01,  6.29435115e-01,  9.91359056e-01,  8.17411913e-01,
       -1.25650166e+00,  7.29543132e-01, -1.59448335e+00,  7.24200620e-01,
       -1.19251821e-01,  6.88567741e-01, -6.96385746e-01,  8.65987845e-01,
        8.95335937e-02,  3.22201432e-01,  4.00059449e-01, -1.21660906e+00,
       -2.29148806e-01,  9.98401605e-01,  4.36811397e-01,  2.23144341e+00,
        1.01827145e+00, -2.39009104e+00, -1.35395578e+00, -1.09340569e-02,
       -1.50318171e+00, -3.09822566e-01, -1.82014980e+00,  5.17562076e-01,
       -5.73342235e-01,  4.62930692e-02,  6.95196519e-01, -2.16743848e-01,
        6.21912889e-01, -4.56439742e-01,  1.88301921e-01, -5.28594115e-01,
        1.23782524e+00, -7.01129709e-02, -9.15028868e-02,  8.29870649e-01,
        1.00309939e+00,  1.23099641e-01, -5.04216576e-01, -3.39562331e-01,
        4.84148390e-01,  1.38087802e+00, -1.12665408e+00, -1.44963491e+00,
        2.53568093e-01, -4.82749957e-01,  7.03011158e-01, -2.93719084e-01,
       -2.36455622e-01, -7.19748373e-01, -4.88418360e-01, -6.26962361e-01,
       -8.35797385e-01,  1.17021810e+00,  1.31362848e+00,  9.60415797e-01,
        4.83737002e-01, -1.08881763e+00, -5.13965780e-01, -2.01948726e+00,
       -2.10753982e-01, -6.76738244e-02, -1.81170047e+00,  1.63819258e+00,
       -9.44863645e-01, -1.31515186e-01, -1.49486276e+00,  2.17604988e+00,
       -3.05267357e-01,  4.38991704e-01, -1.52274691e+00, -9.91747533e-02,
        2.60202579e-02,  1.53153977e-02, -2.35038785e+00, -8.73577178e-01,
       -9.51702990e-01, -2.85815945e-01,  2.28106047e-01, -1.77528638e+00,
        9.16936117e-01, -8.35671159e-01, -1.77502896e-01, -7.86450043e-01,
       -8.65586288e-01, -6.66742454e-01,  1.58948820e-01, -4.38495758e-01,
       -1.42705192e-01,  5.67266760e-01,  5.92599566e-01, -4.21018640e-01,
       -3.94171582e-01, -5.09467066e-01, -9.55142219e-01,  2.00140119e+00,
       -9.30323886e-01,  2.86553967e-03, -7.83085699e-01, -7.03528543e-01,
       -9.19262142e-01,  1.92197833e-01, -6.11934922e-02, -1.85849762e+00,
        5.04929074e-01, -3.75864883e-01,  4.49928417e-01, -6.16675537e-01,
       -1.01572314e+00, -2.27887527e+00,  1.08405062e+00, -5.05977279e-01,
       -9.13021165e-01,  2.18796678e+00,  1.67673235e-02, -2.29199706e-01,
       -6.58139458e-01, -1.37221284e+00, -5.47663366e-01, -4.19062351e-01,
       -7.48409511e-01,  7.19955753e-01, -7.69186499e-01, -5.37050119e-01,
       -5.03205559e-01,  1.43543572e+00,  1.45043537e+00,  8.39902820e-01,
        3.60045167e-01,  9.27186838e-01, -4.45536747e-01, -4.32746313e-01,
        1.53825918e-02,  6.23410354e-01, -1.26117325e-01,  2.75635177e-01,
        3.40009487e-01, -4.72562379e-02, -1.07575764e+00, -1.01754496e+00,
        1.29211515e+00, -3.14652168e-01, -1.32435519e+00,  7.50016624e-02,
       -5.45257545e-01, -1.58251146e+00, -1.20916812e+00,  1.63405252e+00,
        1.02973812e+00,  7.01033941e-01,  1.06267835e+00,  8.59157900e-01,
       -1.04393777e+00,  1.63007955e-01, -1.19177459e+00,  3.19220711e-02,
       -8.01872592e-01, -5.92420072e-01, -3.36884928e-01,  1.14604959e+00,
        7.09797467e-01, -5.97810142e-01,  6.74132122e-01,  4.86936074e-01,
       -1.40337580e+00,  1.25572653e+00,  7.17502914e-01, -1.12097234e-01,
        1.55995885e-01, -1.32434698e+00,  1.48234948e+00,  1.79519314e+00,
        1.02002443e+00, -1.80061190e-01, -7.61211625e-01, -6.05741546e-02,
        6.52869591e-01,  9.53272525e-01, -1.33683041e+00, -1.17283680e-01,
        2.92814899e-01,  1.38270053e+00, -4.11885148e-01, -2.95336925e-01,
        1.02584266e-01,  7.02374147e-01, -6.47783216e-01,  3.82379671e-01,
       -1.67455808e+00, -6.60729313e-01, -1.18367799e-01, -1.70391678e+00,
       -1.48777992e+00,  3.12032406e-01, -1.39837371e+00,  1.30566375e+00,
       -9.48734659e-01,  2.08380890e+00, -5.09952544e-01, -1.11112567e+00,
       -1.70107404e+00,  2.43224387e+00, -2.74601625e-01, -7.14980080e-01,
       -1.37452246e+00, -8.86859977e-01,  1.73853711e+00, -8.55859438e-01,
        6.83149537e-01, -6.07819562e-01,  1.83407492e+00,  1.35199981e+00,
        1.28219085e+00,  3.07251524e-01,  5.43888661e-01, -1.24394431e+00,
       -7.36641682e-02,  1.24321868e+00,  2.36923384e-01, -4.11917354e-01,
        3.14639200e-01,  3.74485767e-01,  2.94762201e-01,  9.35752762e-01,
        9.93262662e-03, -1.47808839e+00, -7.93219813e-01,  1.90074064e+00,
        1.29442030e-01, -8.70484694e-01,  7.66229827e-01,  9.22953968e-01,
        7.30764650e-01, -3.96552308e-01, -4.96115599e-01, -3.18193559e-01,
       -2.03187424e+00,  7.69015311e-01,  1.21802976e+00,  4.64184767e-01,
        4.08937882e-01, -1.32950760e+00,  1.28052942e+00, -4.63465236e-01,
       -7.21355762e-01, -1.90190567e+00,  5.08565461e-02,  1.41993765e+00,
       -1.97749731e+00,  6.42977336e-01,  1.27307020e+00,  4.29130447e-01,
       -1.09133193e+00,  1.43280905e-01, -6.11938576e-01,  6.91088819e-01,
        9.31651399e-02,  1.26319489e+00,  6.91964896e-01, -5.22349431e-01,
       -1.50454157e+00,  2.21152696e+00, -7.44929552e-01, -1.47553860e+00,
        8.35621805e-01,  1.14496059e+00, -1.21411221e+00, -6.42502712e-01,
       -1.07435952e+00, -8.02725951e-02,  1.38353136e+00,  1.68904343e+00,
       -7.72904181e-01,  3.24879303e-01, -1.72270012e+00,  7.23197261e-01,
        1.38306686e+00, -7.75354513e-01,  1.55380063e+00,  1.81959689e+00,
       -1.61935316e+00,  1.97472456e-01, -3.15870401e-01,  3.61361797e-01,
        5.57817862e-01, -7.42835045e-01, -6.52984195e-01, -1.06971124e-02,
       -1.04922784e+00,  6.69343825e-01,  3.01242450e-01,  7.47274057e-01,
        2.22381254e-01, -3.27196114e-01,  9.42437624e-01,  1.19010847e+00,
       -9.30155057e-01, -1.77690253e+00,  4.54895102e-01,  5.18207829e-01,
        9.52677401e-01, -5.53080983e-01, -1.36963655e+00, -1.80863314e+00,
       -4.89739667e-02, -5.30377263e-01,  3.60489157e-01,  5.91413579e-01,
       -5.73006419e-01, -8.74738587e-01, -3.68271712e-01,  2.33804023e-01,
       -3.93648231e-01,  1.69153878e+00,  2.91957388e-01,  1.17114259e+00,
       -1.79336582e+00, -6.68844626e-01,  1.53958921e+00, -3.95654305e-01,
       -2.48846853e-01,  7.36059258e-01, -1.75511374e+00,  6.13491759e-01,
        3.16189870e-01,  2.18353480e-01, -1.48402235e-02, -1.00867479e+00,
        1.31073518e+00, -1.15559337e+00, -1.01808003e-02,  3.73627289e-01,
       -7.93452560e-02, -1.81612286e+00, -1.01779567e+00, -1.52322034e-01,
        1.21232669e+00, -4.31645209e-01, -4.17254684e-01,  1.53798060e+00,
       -4.65903951e-01, -5.30791312e-02,  1.99220749e-01,  1.12908627e-01,
        1.97915971e-01,  2.46562342e+00,  1.01371136e+00, -1.83080759e+00,
        1.06676721e-01, -6.50065391e-01,  7.13142761e-02, -1.13223002e+00,
       -5.48142479e-01,  6.38087943e-01, -1.17179297e+00, -1.73860578e+00,
        6.63533250e-01,  4.36483669e-01,  5.04364698e-01, -5.82491696e-01,
       -7.16784966e-01, -1.71017092e+00, -1.72522196e-01,  1.15729672e+00,
        1.96801282e-01, -1.31370110e-01,  5.80898040e-01, -1.82163864e+00,
        5.16292476e-01,  1.11702664e-01,  4.26571863e-01,  8.28376221e-01,
        8.87871164e-01, -7.06699756e-01,  2.33300350e-01, -1.23420625e+00,
       -1.56577003e+00, -1.05708202e-01, -1.78633164e+00,  4.49925067e-01,
       -7.39070221e-02, -1.10039476e+00,  1.31834324e+00,  8.35236292e-01,
       -1.40637516e+00, -5.55894783e-01, -1.20149864e+00, -1.03469873e+00,
        3.81373332e-01,  1.33493039e+00, -2.66118667e-01,  7.67711866e-01,
       -1.33226780e+00,  4.28143153e-01, -7.54744107e-01, -1.20215537e+00,
        4.06602064e-01,  4.13646694e-01,  3.83778932e-01,  9.55027382e-01,
       -3.17736423e-01, -5.91424400e-01, -3.24298899e-01,  1.30957402e+00,
       -5.72088920e-01, -3.80500852e-01,  6.13419660e-01, -3.27070608e-01,
        1.83475048e+00,  3.90399916e-01,  2.96545734e-01,  8.55172539e-02,
       -1.61446562e+00,  1.09415026e+00,  8.00191054e-01,  1.18163833e+00,
       -1.47897761e-01, -6.82192680e-01, -3.99766851e-02, -4.87283015e-01,
       -6.45563755e-02, -4.15959530e-02,  4.68451268e-01, -4.15417309e-01,
       -6.31463307e-01,  2.45143494e+00, -4.21790588e-01, -7.38118765e-01,
       -3.42621890e+00,  1.47216779e-01, -1.59836106e+00,  2.60727097e-02,
       -2.23711314e-02,  6.77487640e-01, -4.52709242e-01, -4.56766370e-01,
        1.18226350e+00, -1.94719050e-01, -4.34001187e-01,  1.11694003e-01,
       -1.32078356e+00,  5.07548898e-01, -1.21044889e-01,  9.16998395e-01,
        1.39931383e+00,  1.67732269e+00, -2.64023417e-01,  1.58863889e+00,
        1.68002127e+00,  6.85379345e-02, -2.73714407e-01, -5.17044863e-02,
        1.27924443e+00, -2.14185393e+00,  1.83825590e+00,  2.40207691e-01,
       -2.16285376e+00, -2.77731851e-01, -5.44214142e-01, -7.90970777e-01,
       -2.31699158e-01, -1.69690205e+00,  3.46382800e-01, -1.43910877e+00,
        6.09971717e-01,  3.34355305e-01, -2.06988877e-01,  6.09921067e-01,
       -1.21325062e+00, -6.48533453e-01, -5.02910607e-01, -9.42029271e-01,
       -5.46065962e-01,  1.33672146e+00,  5.52078326e-01,  7.00941944e-01,
        4.02249966e-01, -1.38099959e-01,  1.93361784e+00,  3.04911945e+00,
       -3.60466631e-01,  1.14641334e+00, -1.84993620e-01,  1.75180133e-01,
        7.36926099e-01,  6.77547655e-01,  1.85530389e+00,  5.57480005e-01,
       -3.64696748e-01, -2.52105412e-01,  2.31969643e+00, -2.42439516e+00,
       -6.97621697e-01, -9.05031857e-01,  7.76169029e-01, -1.13777135e-01,
        1.54140824e+00, -9.08182644e-02,  1.22133315e+00, -9.70348583e-01,
       -2.01951623e-01, -6.87746133e-01, -1.91326597e-01,  1.14710168e+00,
        1.56413742e-01,  6.15982347e-01, -1.63335852e-01, -1.49559030e-01,
        2.20744854e-02, -4.11774626e-01,  6.05711204e-03, -1.05502765e+00,
       -1.66919991e-01,  2.45016337e-03,  1.41859912e-01, -3.69308461e-01,
        7.62511419e-01, -6.52736082e-01,  5.47180357e-02, -1.32851206e-01,
        1.81685290e+00,  5.81878552e-01,  8.05821160e-02, -4.46675910e-02,
       -2.76690558e-01,  7.16091170e-01, -8.21982294e-01,  3.43807889e-01,
       -4.27396384e-01, -9.44499440e-01, -1.43215576e+00,  8.40036466e-01,
       -1.17953311e+00, -2.47972855e-01,  3.61822065e-01,  7.13983013e-01,
       -2.84222817e+00, -4.43479938e-01,  2.31416675e+00, -5.26378275e-01,
       -1.60217954e+00, -1.41901059e+00,  1.26065885e-01, -1.88814284e-01,
       -4.69388502e-01, -4.59902905e-01,  3.75451047e-01, -7.03645489e-01,
        6.25485307e-01,  8.15701204e-01, -1.18965011e+00, -5.24602327e-01,
        1.24196011e+00,  1.22681837e+00,  9.78156677e-01, -3.22524794e-01,
       -2.90139596e-01, -1.50166839e-01, -1.07861717e+00, -2.19885339e+00,
        6.68314558e-01, -1.18479308e+00,  6.79171338e-01, -3.29088068e-01,
       -1.01520579e+00, -1.47970635e+00, -6.48268073e-01, -9.10280750e-01,
        1.44228576e+00, -2.78078221e-01,  1.12081996e+00,  1.27463764e-01,
       -5.89074603e-01, -2.00769707e+00,  1.58288541e-01,  9.35265223e-01,
        8.33341924e-01,  2.63561498e+00,  5.59714812e-01, -1.14269558e+00,
        3.14167114e-01, -4.67842477e-01,  8.32473467e-01,  1.62357784e+00,
       -1.07301787e+00, -9.85501643e-02,  1.58125125e+00, -1.54799225e-01,
        1.01517051e-01,  5.24754002e-01,  1.56340970e+00, -1.29557234e+00,
       -8.70055111e-01, -1.31197284e+00, -2.13894236e+00,  6.80175644e-01,
        8.12647946e-01, -9.90072624e-01,  3.72884625e-01, -6.03137753e-01,
       -7.05707604e-01,  2.16425293e+00,  7.04237860e-02, -1.14431652e+00,
        1.03061744e+00, -3.42478661e-01,  7.77180650e-01, -4.67989822e-01,
        1.06440027e+00, -1.93962843e+00,  5.87611871e-01,  6.22521152e-01,
       -9.62798522e-01, -6.83333819e-01,  6.45654914e-01,  4.54416620e-01,
        1.94213954e-01, -3.08548036e-01,  8.95618014e-02,  1.66530196e-01,
        2.12268707e-01, -5.37950088e-02,  9.47632426e-02,  5.23663498e-01,
       -1.14862251e+00,  5.90171794e-01, -1.25391810e+00, -5.94585721e-01,
       -4.84883446e-01,  1.14583503e+00,  4.52458887e-01, -2.45332924e-01,
        2.61448038e-01,  8.34161452e-01, -7.14900226e-01, -6.10715488e-01,
        7.74018907e-02,  7.02488551e-02, -8.91887840e-01,  1.04006154e+00,
       -3.36592479e-01,  1.03096360e+00,  9.14701416e-01,  4.55114749e-01,
        1.56359238e+00,  1.25113356e+00, -5.92186617e-01, -6.05181898e-01,
       -2.24048134e-01, -1.78075686e+00, -1.67516138e-01, -1.23520773e+00,
        1.19015041e+00,  2.64338421e-01,  1.22545063e+00, -8.02194134e-01,
       -9.95948540e-01,  4.62342488e-01, -2.73174299e-02,  4.54948165e-01,
       -1.22037786e+00,  6.40622191e-02, -3.75092955e-01, -5.85219984e-01,
        1.62927671e+00,  1.31587220e+00,  4.64562167e-01, -1.33212178e-01,
        1.74100347e+00,  7.78711616e-01,  7.95522345e-01, -6.18744639e-01,
        1.70084761e+00,  8.67259528e-02, -6.35465404e-01, -1.23194742e+00,
        9.85890118e-01, -6.67011424e-02,  5.68328540e-01, -1.90779566e-03,
        9.52937150e-01, -6.25946986e-02, -3.57890806e-01, -7.60298918e-01,
       -3.96203411e-01,  6.40125264e-01, -1.51718637e+00, -6.39253755e-01,
       -1.00136307e+00, -7.03002352e-01, -1.19260297e+00,  1.34450692e+00,
       -6.42109249e-01, -3.29879096e-01, -2.67070461e-02,  3.17926090e-01,
       -9.33069139e-01, -2.65616580e-01, -8.64196682e-01, -1.85241112e+00,
        1.69077707e+00, -6.90671595e-01,  6.51534573e-01, -1.05236067e+00,
        7.41906195e-01,  1.10662984e-01,  7.34926800e-01,  2.05042640e+00,
        1.07058680e+00,  2.52598648e-01, -8.65846315e-01,  8.97236584e-01,
        2.07603572e-01, -7.18665147e-01,  2.62649998e-01,  3.47384858e-02,
       -4.98327226e-01,  3.56846320e-01, -1.12969577e+00,  1.96551587e-01,
       -2.29756766e-01, -8.38196166e-01,  2.47191336e+00,  2.40759717e-01,
       -1.80355788e+00, -5.56502477e-02, -1.40470084e-01,  3.87851456e-01,
        5.92256546e-02,  2.59372289e+00,  3.28315012e-01,  5.41312052e-01,
        9.76169577e-01, -1.84873805e+00,  6.57099107e-01,  5.14731362e-01,
        9.40257109e-01,  2.93170701e-01, -9.41029549e-01,  4.99482564e-01,
       -7.84953261e-01,  2.80218242e-01,  9.13449564e-01,  1.37843355e+00,
       -6.55744396e-01,  6.32671852e-01,  2.38813973e-01, -1.61928096e-01,
       -1.69576630e+00,  1.88324843e-01,  1.87547930e+00,  4.91692769e-01,
       -1.30507065e+00,  3.74956810e-01, -8.10605428e-01,  1.09300239e+00,
        4.84601853e-01, -7.64721670e-01, -1.37223293e+00,  4.04693869e-01,
       -9.64142015e-01,  2.97634061e-01,  8.68925736e-01,  3.23103656e-01,
       -1.14359293e+00, -1.87488986e-01,  1.57069772e-02,  9.54235183e-01,
        1.38902744e+00, -6.08668156e-02, -1.07454968e+00,  1.17467362e+00,
        2.02225501e+00,  2.88367309e-01, -5.99316641e-01, -7.07548300e-01,
       -3.74444861e-01,  1.49021190e+00, -1.72629813e+00, -4.25466580e-01,
        2.15307925e+00,  9.56420112e-01, -1.36328433e+00, -1.08374226e+00,
        5.34532076e-01,  7.76243808e-01,  1.90585751e-02, -1.50033956e+00,
       -1.86899338e+00,  1.57656063e+00,  7.21954019e-01,  9.77037188e-01,
        1.06714423e+00,  8.52064288e-01, -9.85301749e-01,  7.64661268e-01,
        2.88742193e-01,  2.34290254e+00, -6.47373012e-01, -6.77613504e-01,
       -9.40132073e-01, -8.35634851e-01,  6.42106886e-02,  1.23911933e+00,
        9.47649352e-01, -2.32618359e-01, -5.80237438e-01,  3.92324817e-02,
       -6.50880249e-01, -7.58032107e-01, -7.47054889e-01, -7.85067709e-02,
        1.89898120e+00,  3.89050501e-01,  1.58936615e+00, -1.49041668e+00,
        1.04147379e+00, -9.60734792e-01,  3.63144960e-01,  9.02316522e-01,
       -1.39080643e+00,  3.74652910e-01, -9.83679510e-01,  7.44719452e-01,
        1.05337374e+00,  1.25393520e+00,  3.40796960e-01, -2.82435707e-01,
        1.70674431e+00,  1.04719302e+00, -8.22742134e-01,  1.05506379e+00,
        1.63535532e+00, -1.27202168e+00,  7.71655405e-01,  5.90244440e-01,
       -7.70848256e-01,  6.03254426e-01,  1.58855003e+00, -9.00726463e-01,
        4.84807672e-01,  1.82404331e+00, -2.38844606e-01,  1.08932335e-02,
        8.13018269e-01, -9.32641876e-01, -1.05188454e+00,  1.30102505e+00,
        9.85399328e-01, -1.62881926e-01, -7.53154254e-01,  3.56755985e-01,
       -2.63881635e-01,  1.44028666e+00,  6.82398826e-01,  1.30276636e+00,
       -3.24595337e-02,  1.50016358e+00, -1.07221996e+00,  1.17256202e+00,
       -6.90462932e-01,  5.79789079e-01, -1.22863148e+00,  7.65846196e-01,
        1.07640482e+00, -5.22086574e-01,  4.45621119e-02, -1.10823086e+00,
        1.23445978e-01, -5.21523049e-01,  3.21763112e-01,  4.53315696e-01,
       -3.08739503e-01, -1.42763528e+00, -1.64443848e+00, -1.91141921e+00,
       -1.29325464e+00,  1.58221980e+00, -2.48478329e+00, -8.01267977e-01,
       -5.92704413e-01,  8.46861032e-01, -1.72216896e+00,  1.24759745e+00,
        5.64319668e-02,  7.82661329e-01, -1.81015472e-01, -3.83169816e-01,
        1.39520656e+00,  1.76230624e+00, -4.06246174e-01,  1.92300602e-01,
        3.55794493e-01, -6.89031394e-02, -1.36829524e+00, -8.56047047e-01,
        7.69488837e-01,  1.68793792e+00, -5.51360528e-01, -1.82164589e+00,
       -2.15733758e+00,  1.57957153e+00,  4.47682366e-01,  5.27727730e-01,
        9.59133411e-01, -4.54595602e-01, -3.44926999e-01,  8.93237588e-01,
       -5.81084032e-01, -1.24077974e+00,  1.19319548e+00,  2.67195070e-01,
       -1.30627493e+00,  5.24740799e-01,  1.76698449e+00, -4.97983574e-01,
       -8.59753996e-01,  1.54480484e-01, -5.64588857e-01,  1.71998982e+00,
        3.33294393e-02,  8.36826966e-01,  1.90932358e-01,  6.21821285e-02,
       -4.86131749e-01, -4.80693024e-01, -4.45035397e-01, -3.42977486e-01,
        7.82965091e-01,  1.44659839e-01, -1.12213660e+00,  1.22878324e+00,
        2.46518317e-01,  1.41550875e-01, -1.81112016e+00,  1.57419104e+00,
        7.21552650e-01,  4.63538945e-01, -5.54505448e-01, -1.34563552e+00,
        6.00161186e-01,  3.37821520e-01,  1.33783462e+00, -8.16607447e-02,
        2.80062183e-01,  4.79567938e-02, -4.29511275e-01, -5.29948533e-02,
       -5.75989126e-01, -1.04141539e+00, -3.12573389e-01, -3.74837169e-01,
        7.15253041e-01,  6.42502706e-01,  4.57834460e-01,  8.34086978e-01,
        1.61082173e-01,  1.80850170e+00, -7.95081968e-01,  8.13138388e-01,
        4.24528200e-02, -8.89149778e-01,  1.09391896e+00,  1.41187368e+00,
        5.26656784e-01,  1.79329124e+00, -9.21399087e-01,  3.68736511e-02,
       -8.96142872e-01, -1.03373515e+00, -1.49218838e-01, -1.71854538e+00,
        1.16524564e-03, -3.21695268e-01, -2.02452842e-01,  7.30875972e-01,
        2.51176872e-01, -1.75841360e-02, -3.29077636e-01, -4.31291669e-02,
        9.58643274e-01, -3.64768374e-01, -1.19076264e+00, -1.82544363e-01,
       -8.31483031e-01,  5.16728363e-01,  1.13102052e+00, -1.07048651e+00])

In [125]:
(np.mean(distribution)-distribution)**2

array([2.36433651e+00, 2.77230618e-02, 1.13335139e+00, 5.46007779e+00,
       6.61656270e-03, 7.81801081e-01, 1.87770467e+00, 8.55577493e-01,
       2.61591611e-01, 3.96188564e-01, 9.82792778e-01, 6.68162236e-01,
       1.57879642e+00, 5.32233182e-01, 2.54237716e+00, 5.24466538e-01,
       1.42209969e-02, 4.74125534e-01, 4.84953108e-01, 7.49934948e-01,
       8.01626440e-03, 1.03813763e-01, 1.60047563e-01, 1.48013760e+00,
       5.25091752e-02, 9.96805765e-01, 1.90804197e-01, 4.97933971e+00,
       1.03687675e+00, 5.71253517e+00, 1.83319625e+00, 1.19553599e-04,
       2.25955526e+00, 9.59900222e-02, 3.31294530e+00, 2.67870503e-01,
       3.28721319e-01, 2.14304826e-03, 4.83298200e-01, 4.69778958e-02,
       3.86775641e-01, 2.08337238e-01, 3.54576135e-02, 2.79411738e-01,
       1.53221133e+00, 4.91582869e-03, 8.37277830e-03, 6.88685294e-01,
       1.00620840e+00, 1.51535217e-02, 2.54234355e-01, 1.15302577e-01,
       2.34399664e-01, 1.90682410e+00, 1.26934941e+00, 2.10144138e+00,
       6.42967780e-02, 2.33047521e-01, 4.94224688e-01, 8.62709000e-02,
       5.59112612e-02, 5.18037720e-01, 2.38552494e-01, 3.93081803e-01,
       6.98557268e-01, 1.36941039e+00, 1.72561978e+00, 9.22398503e-01,
       2.34001488e-01, 1.18552384e+00, 2.64160823e-01, 4.07832880e+00,
       4.44172409e-02, 4.57974651e-03, 3.28225859e+00, 2.68367494e+00,
       8.92767307e-01, 1.72962441e-02, 2.23461466e+00, 4.73519308e+00,
       9.31881590e-02, 1.92713716e-01, 2.31875816e+00, 9.83563169e-03,
       6.77053820e-04, 2.34561408e-04, 5.52432303e+00, 7.63137087e-01,
       9.05738581e-01, 8.16907545e-02, 5.20323685e-02, 3.15164173e+00,
       8.40771842e-01, 6.98346287e-01, 3.15072781e-02, 6.18503669e-01,
       7.49239622e-01, 4.44545500e-01, 2.52647275e-02, 1.92278530e-01,
       2.03647719e-02, 3.21791577e-01, 3.51174246e-01, 1.77256695e-01,
       1.55371236e-01, 2.59556692e-01, 9.12296658e-01, 4.00560671e+00,
       8.65502533e-01, 8.21131760e-06, 6.13223212e-01, 4.94952411e-01,
       8.45042886e-01, 3.69400068e-02, 3.74464349e-03, 3.45401339e+00,
       2.54953370e-01, 1.41274411e-01, 2.02435580e-01, 3.80288718e-01,
       1.03169350e+00, 5.19327251e+00, 1.17516576e+00, 2.56013007e-01,
       8.33607648e-01, 4.78719865e+00, 2.81143139e-04, 5.25325052e-02,
       4.33147546e-01, 1.88296807e+00, 2.99935162e-01, 1.75613254e-01,
       5.60116797e-01, 5.18336287e-01, 5.91647871e-01, 2.88422830e-01,
       2.53215835e-01, 2.06047570e+00, 2.10376276e+00, 7.05436747e-01,
       1.29632522e-01, 8.59675433e-01, 1.98502993e-01, 1.87269372e-01,
       2.36624130e-04, 3.88640469e-01, 1.59055796e-02, 7.59747509e-02,
       1.15606452e-01, 2.23315202e-03, 1.15725450e+00, 1.03539775e+00,
       1.66956156e+00, 9.90059866e-02, 1.75391667e+00, 5.62524936e-03,
       2.97305791e-01, 2.50434253e+00, 1.46208755e+00, 2.67012765e+00,
       1.06036060e+00, 4.91448586e-01, 1.12928527e+00, 7.38152297e-01,
       1.08980606e+00, 2.65715933e-02, 1.42032668e+00, 1.01901863e-03,
       6.42999654e-01, 3.50961542e-01, 1.13491455e-01, 1.31342966e+00,
       5.03812444e-01, 3.57376966e-01, 4.54454118e-01, 2.37106740e-01,
       1.96946362e+00, 1.57684911e+00, 5.14810432e-01, 1.25657899e-02,
       2.43347162e-02, 1.75389494e+00, 2.19736000e+00, 3.22271843e+00,
       1.04044983e+00, 3.24220322e-02, 5.79443138e-01, 3.66922820e-03,
       4.26238703e-01, 9.08728508e-01, 1.78711553e+00, 1.37554616e-02,
       8.57405650e-02, 1.91186077e+00, 1.69649375e-01, 8.72238992e-02,
       1.05235317e-02, 4.93329442e-01, 4.19623095e-01, 1.46214213e-01,
       2.80414477e+00, 4.36563225e-01, 1.40109359e-02, 2.90333238e+00,
       2.21348910e+00, 9.73642225e-02, 1.95544902e+00, 1.70475784e+00,
       9.00097453e-01, 4.34225955e+00, 2.60051597e-01, 1.23460026e+00,
       2.89365289e+00, 5.91581024e+00, 7.54060524e-02, 5.11196515e-01,
       1.88931198e+00, 7.86520618e-01, 3.02251130e+00, 7.32495378e-01,
       4.66693290e-01, 3.69444620e-01, 3.36383080e+00, 1.82790349e+00,
       1.64401339e+00, 9.44034992e-02, 2.95814875e-01, 1.54739744e+00,
       5.42640968e-03, 1.54559269e+00, 5.61326900e-02, 1.69675907e-01,
       9.89978261e-02, 1.40239590e-01, 8.68847552e-02, 8.75633231e-01,
       9.86570715e-05, 2.18474528e+00, 6.29197672e-01, 3.61281498e+00,
       1.67552391e-02, 7.57743602e-01, 5.87108148e-01, 8.51844027e-01,
       5.34016974e-01, 1.57253733e-01, 2.46130688e-01, 1.01247141e-01,
       4.12851294e+00, 5.91384549e-01, 1.48359650e+00, 2.15467497e-01,
       1.67230192e-01, 1.76759047e+00, 1.63975561e+00, 2.14800025e-01,
       5.20354136e-01, 3.61724518e+00, 2.58638828e-03, 2.01622293e+00,
       3.91049560e+00, 4.13419855e-01, 1.62070773e+00, 1.84152940e-01,
       1.19100539e+00, 2.05294176e-02, 3.74468821e-01, 4.77603756e-01,
       8.67974330e-03, 1.59566132e+00, 4.78815418e-01, 2.72848928e-01,
       2.26364534e+00, 4.89085148e+00, 5.54920038e-01, 2.17721415e+00,
       6.98263800e-01, 1.31093476e+00, 1.47406847e+00, 4.12809735e-01,
       1.15424838e+00, 6.44368953e-03, 1.91415902e+00, 2.85286771e+00,
       5.97380873e-01, 1.05546561e-01, 2.96769571e+00, 5.23014279e-01,
       1.91287393e+00, 6.01174621e-01, 2.41429639e+00, 3.31093284e+00,
       2.62230466e+00, 3.89953709e-02, 9.97741102e-02, 1.30582348e-01,
       3.11160767e-01, 5.51803905e-01, 4.26388359e-01, 1.14428213e-04,
       1.10087906e+00, 4.48021156e-01, 9.07470136e-02, 5.58418517e-01,
       4.94534223e-02, 1.07057297e-01, 8.88188675e-01, 1.41635818e+00,
       8.65188430e-01, 3.15738261e+00, 2.06929554e-01, 2.68539354e-01,
       9.07594230e-01, 3.05898574e-01, 1.87590427e+00, 3.27115385e+00,
       2.39844941e-03, 2.81300041e-01, 1.29952432e-01, 3.49770021e-01,
       3.28336356e-01, 7.65167596e-01, 1.35624054e-01, 5.46643211e-02,
       1.54958930e-01, 2.86130343e+00, 8.52391163e-02, 1.37157496e+00,
       3.21616095e+00, 4.47353134e-01, 2.37033494e+00, 1.56542329e-01,
       6.19247564e-02, 5.41783231e-01, 3.08042425e+00, 3.76372138e-01,
       9.99760342e-02, 4.76782421e-02, 2.20232233e-04, 1.01742484e+00,
       1.71802670e+00, 1.33539605e+00, 1.03648695e-04, 1.39597351e-01,
       6.29566965e-03, 3.29830224e+00, 1.03590803e+00, 2.32020021e-02,
       1.46973600e+00, 1.86317587e-01, 1.74101471e-01, 2.36538431e+00,
       2.17066491e-01, 2.81739417e-03, 3.96889070e-02, 1.27483582e-02,
       3.91707317e-02, 6.07929887e+00, 1.02761071e+00, 3.35185645e+00,
       1.13799228e-02, 4.22585013e-01, 5.08572597e-03, 1.28194482e+00,
       3.00460178e-01, 4.07156223e-01, 1.37309875e+00, 3.02275006e+00,
       4.40276374e-01, 1.90517994e-01, 2.54383749e-01, 3.39296576e-01,
       5.13780687e-01, 2.92468456e+00, 2.97639083e-02, 1.33933571e+00,
       3.87307446e-02, 1.72581059e-02, 3.37442533e-01, 3.31836732e+00,
       2.66557920e-01, 1.24774851e-02, 1.81963555e-01, 6.86207163e-01,
       7.88315204e-01, 4.99424545e-01, 5.44290531e-02, 1.52326508e+00,
       2.45163579e+00, 1.11742239e-02, 3.19098071e+00, 2.02432566e-01,
       5.46224792e-03, 1.21086864e+00, 1.73802889e+00, 6.97619663e-01,
       1.97789110e+00, 3.09019009e-01, 1.44359899e+00, 1.07060145e+00,
       1.45445618e-01, 1.78203915e+00, 7.08191448e-02, 5.89381509e-01,
       1.77493749e+00, 1.83306559e-01, 5.69638667e-01, 1.44517752e+00,
       1.65325238e-01, 1.71103587e-01, 1.47286268e-01, 9.12077300e-01,
       1.00956434e-01, 3.49782821e-01, 1.05169776e-01, 1.71498412e+00,
       3.27285733e-01, 1.44780899e-01, 3.76283680e-01, 1.06975182e-01,
       3.36630932e+00, 1.52412094e-01, 8.79393726e-02, 7.31320071e-03,
       2.60649923e+00, 1.19716479e+00, 6.40305724e-01, 1.39626913e+00,
       2.18737476e-02, 4.65386853e-01, 1.59813535e-03, 2.37444736e-01,
       4.16752562e-03, 1.73022331e-03, 2.19446590e-01, 1.72571540e-01,
       3.98745908e-01, 6.00953328e+00, 1.77907300e-01, 5.44819311e-01,
       1.17389760e+01, 2.16727801e-02, 2.55475807e+00, 6.79786189e-04,
       5.00467522e-04, 4.58989503e-01, 2.04945658e-01, 2.08635516e-01,
       1.39774699e+00, 3.79155082e-02, 1.88357030e-01, 1.24755504e-02,
       1.74446921e+00, 2.57605884e-01, 1.46518651e-02, 8.40886056e-01,
       1.95807919e+00, 2.81341142e+00, 6.97083646e-02, 2.52377353e+00,
       2.82247146e+00, 4.69744847e-03, 7.49195764e-02, 2.67335390e-03,
       1.63646632e+00, 4.58753827e+00, 3.37918475e+00, 5.76997347e-02,
       4.67793638e+00, 7.71349809e-02, 2.96169032e-01, 6.25634771e-01,
       5.36844999e-02, 2.87947658e+00, 1.19981044e-01, 2.07103405e+00,
       3.72065495e-01, 1.11793470e-01, 4.28443954e-02, 3.72003708e-01,
       1.47197707e+00, 4.20595640e-01, 2.52919078e-01, 8.87419148e-01,
       2.98188035e-01, 1.78682427e+00, 3.04790479e-01, 4.91319609e-01,
       1.61805035e-01, 1.90715986e-02, 3.73887796e+00, 9.29712941e+00,
       1.29936192e-01, 1.31426354e+00, 3.42226393e-02, 3.06880792e-02,
       5.43060075e-01, 4.59070825e-01, 3.44215253e+00, 3.10783956e-01,
       1.33003718e-01, 6.35571390e-02, 5.38099152e+00, 5.87769187e+00,
       4.86676031e-01, 8.19082662e-01, 6.02438362e-01, 1.29452364e-02,
       2.37593935e+00, 8.24795715e-03, 1.49165466e+00, 9.41576372e-01,
       4.07844581e-02, 4.72994743e-01, 3.66058668e-02, 1.31584227e+00,
       2.44652585e-02, 3.79434252e-01, 2.66786005e-02, 2.23679033e-02,
       4.87282908e-04, 1.69558343e-01, 3.66886062e-05, 1.11308334e+00,
       2.78622835e-02, 6.00330053e-06, 2.01242347e-02, 1.36388740e-01,
       5.81423664e-01, 4.26064393e-01, 2.99406343e-03, 1.76494429e-02,
       3.30095448e+00, 3.38582649e-01, 6.49347743e-03, 1.99519369e-03,
       7.65576650e-02, 5.12786564e-01, 6.75654892e-01, 1.18203865e-01,
       1.82667669e-01, 8.92079193e-01, 2.05107013e+00, 7.05661265e-01,
       1.39129835e+00, 6.14905368e-02, 1.30915207e-01, 5.09771742e-01,
       8.07826098e+00, 1.96674456e-01, 5.35536774e+00, 2.77074089e-01,
       2.56697928e+00, 2.01359106e+00, 1.58926073e-02, 3.56508337e-02,
       2.20325566e-01, 2.11510682e-01, 1.40963489e-01, 4.95116974e-01,
       3.91231869e-01, 6.65368455e-01, 1.41526740e+00, 2.75207602e-01,
       1.54246492e+00, 1.50508332e+00, 9.56790484e-01, 1.04022243e-01,
       8.41809850e-02, 2.25500796e-02, 1.16341500e+00, 4.83495623e+00,
       4.46644348e-01, 1.40373465e+00, 4.61273707e-01, 1.08298956e-01,
       1.03064280e+00, 2.18953089e+00, 4.20251495e-01, 8.28611043e-01,
       2.08018822e+00, 7.73274970e-02, 1.25623738e+00, 1.62470111e-02,
       3.47008888e-01, 4.03084753e+00, 2.50552622e-02, 8.74721038e-01,
       6.94458762e-01, 6.94646632e+00, 3.13280671e-01, 1.30575319e+00,
       9.87009758e-02, 2.18876584e-01, 6.93012073e-01, 2.63600500e+00,
       1.15136736e+00, 9.71213488e-03, 2.50035551e+00, 2.39628001e-02,
       1.03057116e-02, 2.75366763e-01, 2.44424990e+00, 1.67850770e+00,
       7.56995895e-01, 1.72127274e+00, 4.57507441e+00, 4.62638906e-01,
       6.60396685e-01, 9.80243801e-01, 1.39042944e-01, 3.63775149e-01,
       4.98023222e-01, 4.68399076e+00, 4.95950964e-03, 1.30946030e+00,
       1.06217231e+00, 1.17291633e-01, 6.04009762e-01, 2.19014474e-01,
       1.13294793e+00, 3.76215844e+00, 3.45287711e-01, 3.87532585e-01,
       9.26980994e-01, 4.66945109e-01, 4.16870268e-01, 2.06494465e-01,
       3.77190600e-02, 9.52018908e-02, 8.02131627e-03, 2.77323062e-02,
       4.50580041e-02, 2.89390297e-03, 8.98007215e-03, 2.74223459e-01,
       1.31933367e+00, 3.48302747e-01, 1.57231060e+00, 3.53532179e-01,
       2.35111957e-01, 1.31293792e+00, 2.04719044e-01, 6.01882436e-02,
       6.83550765e-02, 6.95825328e-01, 5.11082333e-01, 3.72973407e-01,
       5.99105268e-03, 4.93490164e-03, 7.95463920e-01, 1.08172801e+00,
       1.13294497e-01, 1.06288594e+00, 8.36678680e-01, 2.07129435e-01,
       2.44482113e+00, 1.56533518e+00, 3.50684990e-01, 3.66245130e-01,
       5.01975662e-02, 3.17109498e+00, 2.80616566e-02, 1.52573813e+00,
       1.41645801e+00, 6.98748009e-02, 1.50172924e+00, 6.43515428e-01,
       9.91913495e-01, 2.13760577e-01, 7.46241977e-04, 2.06977833e-01,
       1.48932213e+00, 4.10396791e-03, 1.40694725e-01, 3.42482430e-01,
       2.65454259e+00, 1.73151965e+00, 2.15818007e-01, 1.77454844e-02,
       3.03109307e+00, 6.06391781e-01, 6.32855801e-01, 3.82844928e-01,
       2.89288259e+00, 7.52139089e-03, 4.03816280e-01, 1.51769445e+00,
       9.71979325e-01, 4.44904240e-03, 3.22997329e-01, 3.63968428e-06,
       9.08089211e-01, 3.91809629e-03, 1.28085829e-01, 5.78054445e-01,
       1.56977143e-01, 4.09760354e-01, 2.30185448e+00, 4.08645364e-01,
       1.00272799e+00, 4.94212307e-01, 1.42230184e+00, 1.80769886e+00,
       4.12304287e-01, 1.08820218e-01, 7.13266312e-04, 1.01076999e-01,
       8.70618018e-01, 7.05521675e-02, 7.46835905e-01, 3.43142695e+00,
       2.85872708e+00, 4.77027253e-01, 4.24497299e-01, 1.10746298e+00,
       5.50424802e-01, 1.22462960e-02, 5.40117402e-01, 4.20424844e+00,
       1.14615610e+00, 6.38060767e-02, 7.49689842e-01, 8.05033488e-01,
       4.30992433e-02, 5.16479594e-01, 6.89850217e-02, 1.20676239e-03,
       2.48330024e-01, 1.27339296e-01, 1.27621252e+00, 3.86325265e-02,
       5.27881716e-02, 7.02572813e-01, 6.11035564e+00, 5.79652414e-02,
       3.25282101e+00, 3.09695007e-03, 1.97318445e-02, 1.50428752e-01,
       3.50767816e-03, 6.72739840e+00, 1.07790747e-01, 2.93018738e-01,
       9.52907044e-01, 3.41783237e+00, 4.31779236e-01, 2.64948375e-01,
       8.84083432e-01, 8.59490598e-02, 8.85536611e-01, 2.49482831e-01,
       6.16151622e-01, 7.85222631e-02, 8.34390107e-01, 1.90007905e+00,
       4.30000712e-01, 4.00273673e-01, 5.70321136e-02, 2.62207082e-02,
       2.87562334e+00, 3.54662466e-02, 3.51742259e+00, 2.41761779e-01,
       1.70320941e+00, 1.40592610e-01, 6.57081159e-01, 1.19465423e+00,
       2.34838956e-01, 5.84799233e-01, 1.88302322e+00, 1.63777127e-01,
       9.29569824e-01, 8.85860341e-02, 7.55031935e-01, 1.04395973e-01,
       1.30780479e+00, 3.51521198e-02, 2.46709132e-04, 9.10564785e-01,
       1.92939724e+00, 3.70476925e-03, 1.15465702e+00, 1.37985810e+00,
       4.08951534e+00, 8.31557046e-02, 3.59180437e-01, 5.00624596e-01,
       1.40208954e-01, 2.22073149e+00, 2.98010524e+00, 1.81021810e-01,
       4.63575026e+00, 9.14739431e-01, 1.85854418e+00, 1.17449728e+00,
       2.85724540e-01, 6.02554449e-01, 3.63229285e-04, 2.25101879e+00,
       3.49313626e+00, 2.48554342e+00, 5.21217606e-01, 9.54601667e-01,
       1.13879681e+00, 7.26013552e-01, 9.70819537e-01, 5.84706855e-01,
       8.33720542e-02, 5.48919232e+00, 4.19091816e-01, 4.59160061e-01,
       8.83848315e-01, 6.98285605e-01, 4.12301253e-03, 1.53541670e+00,
       8.98039295e-01, 5.41113009e-02, 3.36675484e-01, 1.53918762e-03,
       4.23645098e-01, 5.74612676e-01, 5.58091007e-01, 6.16331308e-03,
       3.60612960e+00, 1.51360292e-01, 2.52608476e+00, 2.22134187e+00,
       1.08466766e+00, 9.23011340e-01, 1.31874262e-01, 8.14175105e-01,
       1.93434253e+00, 1.40364803e-01, 9.67625378e-01, 5.54607062e-01,
       1.10959623e+00, 1.57235349e+00, 1.16142568e-01, 7.97699289e-02,
       2.91297613e+00, 1.09661321e+00, 6.76904619e-01, 1.11315961e+00,
       2.67438704e+00, 1.61803915e+00, 5.95452065e-01, 3.48388499e-01,
       5.94207034e-01, 3.63915903e-01, 2.52349119e+00, 8.11308162e-01,
       2.35038479e-01, 3.32713400e+00, 5.70467457e-02, 1.18662536e-04,
       6.60998705e-01, 8.69820869e-01, 1.10646109e+00, 1.69266619e+00,
       9.71011836e-01, 2.65305218e-02, 5.67241331e-01, 1.27274833e-01,
       6.96335174e-02, 2.07442566e+00, 4.65668157e-01, 1.69720020e+00,
       1.05362133e-03, 2.25049076e+00, 1.14965564e+00, 1.37490169e+00,
       4.76739060e-01, 3.36155376e-01, 1.50953531e+00, 5.86520395e-01,
       1.15864734e+00, 2.72574391e-01, 1.98578182e-03, 1.22817564e+00,
       1.52389095e-02, 2.71986291e-01, 1.03531500e-01, 2.05495120e-01,
       9.53200807e-02, 2.03814248e+00, 2.70417792e+00, 3.65352338e+00,
       1.67250757e+00, 2.50341950e+00, 6.17414798e+00, 6.42030372e-01,
       3.51298521e-01, 7.17173607e-01, 2.96586594e+00, 1.55649939e+00,
       3.18456688e-03, 6.12558757e-01, 3.27666010e-02, 1.46819108e-01,
       1.94660134e+00, 3.10572330e+00, 1.65035954e-01, 3.69795217e-02,
       1.26589721e-01, 4.74764262e-03, 1.87223186e+00, 7.32816546e-01,
       5.92113071e-01, 2.84913441e+00, 3.03998432e-01, 3.31839375e+00,
       4.65410545e+00, 2.49504621e+00, 2.00419500e-01, 2.78496557e-01,
       9.19936899e-01, 2.06657161e-01, 1.18974634e-01, 7.97873389e-01,
       3.37658653e-01, 1.53953436e+00, 1.42371545e+00, 7.13932053e-02,
       1.70635418e+00, 2.75352906e-01, 3.12223419e+00, 2.47987640e-01,
       7.39176934e-01, 2.38642198e-02, 3.18760577e-01, 2.95836499e+00,
       1.11085152e-03, 7.00279371e-01, 3.64551654e-02, 3.86661710e-03,
       2.36324078e-01, 2.31065783e-01, 1.98056505e-01, 1.17633556e-01,
       6.13034334e-01, 2.09264690e-02, 1.25919055e+00, 1.50990825e+00,
       6.07712804e-02, 2.00366501e-02, 3.28015622e+00, 2.47807744e+00,
       5.20638227e-01, 2.14868353e-01, 3.07476292e-01, 1.81073496e+00,
       3.60193449e-01, 1.14123379e-01, 1.78980146e+00, 6.66847723e-03,
       7.84348262e-02, 2.29985407e-03, 1.84479936e-01, 2.80845448e-03,
       3.31763473e-01, 1.08454601e+00, 9.77021237e-02, 1.40502903e-01,
       5.11586913e-01, 4.12809728e-01, 2.09612393e-01, 6.95701087e-01,
       2.59474663e-02, 3.27067841e+00, 6.32155336e-01, 6.61194038e-01,
       1.80224192e-03, 7.90587327e-01, 1.19665870e+00, 1.99338728e+00,
       2.77367368e-01, 3.21589348e+00, 8.48976277e-01, 1.35966614e-03,
       8.03072047e-01, 1.06860837e+00, 2.22662615e-02, 2.95339822e+00,
       1.35779740e-06, 1.03487846e-01, 4.09871534e-02, 5.34179687e-01,
       6.30898208e-02, 3.09201837e-04, 1.08292090e-01, 1.86012503e-03,
       9.18996927e-01, 1.33055967e-01, 1.41791567e+00, 3.33224444e-02,
       6.91364030e-01, 2.67008201e-01, 1.27920741e+00, 1.14594136e+00])

In [126]:
np.sum((np.mean(distribution)-distribution)**2)

960.780767504948

In [127]:
np.sum((np.mean(distribution)-distribution)**2)/len(distribution)

0.960780767504948

In [128]:
np.sqrt(np.sum((np.mean(distribution)-distribution)**2)/len(distribution))

0.9801942498836381

In [129]:
np.std(distribution)                                    #stats.kurtosis(distribution) stats not defined

0.9801942498836381

# Pandas

In [130]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['store1', 'store1', 'store3']) 
df

         Name Item Purchased  Cost
store1  Chris       Dog Food  22.5
store1  Kevyn   Kitty Litter   2.5
store3  Vinod      Bird Seed   5.0

In [131]:
df.loc['store1']

         Name Item Purchased  Cost
store1  Chris       Dog Food  22.5
store1  Kevyn   Kitty Litter   2.5

In [132]:
type(df.loc['store1'])

pandas.core.frame.DataFrame

In [133]:
df.loc['store1', 'Cost']

store1    22.5
store1     2.5
Name: Cost, dtype: float64

In [134]:
df.loc[:,['Name', 'Cost']]

         Name  Cost
store1  Chris  22.5
store1  Kevyn   2.5
store3  Vinod   5.0

In [135]:
df['Cost']

df.T

df.T.loc['Cost']

store1    22.5
store1     2.5
store3       5
Name: Cost, dtype: object

In [136]:
df.drop('store1')

         Name Item Purchased  Cost
store3  Vinod      Bird Seed   5.0

In [137]:
df

         Name Item Purchased  Cost
store1  Chris       Dog Food  22.5
store1  Kevyn   Kitty Litter   2.5
store3  Vinod      Bird Seed   5.0

In [138]:
copy_df = df.copy()

In [139]:
copy_df.drop('store1')

         Name Item Purchased  Cost
store3  Vinod      Bird Seed   5.0

In [140]:
copy_df

         Name Item Purchased  Cost
store1  Chris       Dog Food  22.5
store1  Kevyn   Kitty Litter   2.5
store3  Vinod      Bird Seed   5.0

In [141]:
copy_df.drop

<bound method DataFrame.drop of          Name Item Purchased  Cost
store1  Chris       Dog Food  22.5
store1  Kevyn   Kitty Litter   2.5
store3  Vinod      Bird Seed   5.0>

In [142]:
del copy_df['Name']
copy_df

       Item Purchased  Cost
store1       Dog Food  22.5
store1   Kitty Litter   2.5
store3      Bird Seed   5.0

In [143]:
df['Location'] = None
df

         Name Item Purchased  Cost Location
store1  Chris       Dog Food  22.5     None
store1  Kevyn   Kitty Litter   2.5     None
store3  Vinod      Bird Seed   5.0     None

In [144]:
df['Cashier'] = 'Tom', 'Peter', 'Paul'
df

         Name Item Purchased  Cost Location Cashier
store1  Chris       Dog Food  22.5     None     Tom
store1  Kevyn   Kitty Litter   2.5     None   Peter
store3  Vinod      Bird Seed   5.0     None    Paul

In [145]:
costs = df['Cost']
costs

store1    22.5
store1     2.5
store3     5.0
Name: Cost, dtype: float64

In [146]:
costs += 2
costs

store1    24.5
store1     4.5
store3     7.0
Name: Cost, dtype: float64

In [147]:
df

         Name Item Purchased  Cost Location Cashier
store1  Chris       Dog Food  24.5     None     Tom
store1  Kevyn   Kitty Litter   4.5     None   Peter
store3  Vinod      Bird Seed   7.0     None    Paul

#  Pandas:Dataframe Indexing and Loading

In [148]:
df = pd.read_csv('train.csv')

In [149]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [150]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [151]:
df['Fare'] > 0

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22     True
23     True
24     True
25     True
26     True
27     True
28     True
29     True
       ...
861    True
862    True
863    True
864    True
865    True
866    True
867    True
868    True
869    True
870    True
871    True
872    True
873    True
874    True
875    True
876    True
877    True
878    True
879    True
880    True
881    True
882    True
883    True
884    True
885    True
886    True
887    True
888    True
889    True
890    True
Name: Fare, Length: 891, dtype: bool

In [152]:
only_fare = df.where(df['Fare'] > 30)
only_fare.head(30)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,7.0,0.0,1.0,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10.0,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0.0,237736,30.0708,NaN,C
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,14.0,0.0,3.0,"Andersson, Mr. Anders Johan",male,39.0,1.0,5.0,347082,31.2750,NaN,S
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,24.0,1.0,1.0,"Sloper, Mr. William Thompson",male,28.0,0.0,0.0,113788,35.5000,A6,S
24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,26.0,1.0,3.0,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1.0,5.0,347077,31.3875,NaN,S
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,28.0,0.0,1.0,"Fortune, Mr. Charles Alexander",male,19.0,3.0,2.0,19950,263.0000,C23 C25 C27,S
28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [153]:
only_fare.count()

PassengerId    234
Survived       234
Pclass         234
Name           234
Sex            234
Age            203
SibSp          234
Parch          234
Ticket         234
Fare           234
Cabin          145
Embarked       232
dtype: int64

In [154]:
only_fare['Fare'].count()

234

In [155]:
df['Fare'].count()

891

In [156]:
only_fare = only_fare.dropna()
only_fare.head()                              #Q difference with df[df['Fare'] > 30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
6,7.0,0.0,1.0,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S
23,24.0,1.0,1.0,"Sloper, Mr. William Thompson",male,28.0,0.0,0.0,113788,35.5000,A6,S
27,28.0,0.0,1.0,"Fortune, Mr. Charles Alexander",male,19.0,3.0,2.0,19950,263.0000,C23 C25 C27,S

In [157]:
only_fare = df[df['Fare'] > 30]
only_fare.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S

In [158]:
len(df[df['Fare'] > 30])

234

In [159]:
len(df['Fare'] > 30)

891

In [160]:
len(df[df['Fare'] > 30 | (df['Fare'] > 30)])

876

In [161]:
df[df['Fare'] > 30 | (df['Fare'] > 30)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [162]:
df[(df['Fare'] > 0) & (df['Fare'] == 30)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
580,581,1,2,"Christy, Miss. Julie Rachel",female,25.0,1,1,237789,30.0,NaN,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S
740,741,1,1,"Hawksford, Mr. Walter James",male,NaN,0,0,16988,30.0,D45,S
782,783,0,1,"Long, Mr. Milton Clyde",male,29.0,0,0,113501,30.0,D6,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0,C148,C

In [163]:
df = df.reset_index()

In [164]:
df.head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [165]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [166]:
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [167]:
df = df[df['Age'] == 50]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
177,178,0,1,"Isham, Miss. Ann Elizabeth",female,50.0,0,0,PC 17595,28.7125,C49,C
259,260,1,2,"Parrish, Mrs. (Lutie Davis)",female,50.0,0,1,230433,26.0000,NaN,S
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.9000,E44,S
458,459,1,2,"Toomey, Miss. Ellen",female,50.0,0,0,F.C.C. 13531,10.5000,NaN,S
482,483,0,3,"Rouse, Mr. Richard Henry",male,50.0,0,0,A/5 3594,8.0500,NaN,S
526,527,1,2,"Ridsdale, Miss. Lucy",female,50.0,0,0,W./C. 14258,10.5000,NaN,S
544,545,0,1,"Douglas, Mr. Walter Donald",male,50.0,1,0,PC 17761,106.4250,C86,C
660,661,1,1,"Frauenthal, Dr. Henry William",male,50.0,2,0,PC 17611,133.6500,NaN,S
723,724,0,2,"Hodges, Mr. Henry Price",male,50.0,0,0,250643,13.0000,NaN,S

#  Pandas:Missing valuesÂ¶

In [168]:
df = pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [169]:
df.fillna

<bound method DataFrame.fillna of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]>

In [170]:
df = df.set_index('PassengerId')
df = df.sort_index()
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [171]:
df = df.reset_index()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [172]:
df = df.set_index(['PassengerId', 'Survived'])
df.head()

,,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Survived,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [173]:
df = df.fillna(method = 'ffill')
df.head()

,,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Survived,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S

# Pandas :Merging Dataframes

In [174]:
df = pd.DataFrame([{'Name': 'MJ', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}], index = ['store1', 'store1', 'store2'])
df

        Cost Item Purchased   Name
store1  22.5         Sponge     MJ
store1   2.5   Kitty Litter  Kevyn
store2   5.0          Spoon  Filip

In [175]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

        Cost Item Purchased   Name        Date
store1  22.5         Sponge     MJ  December 1
store1   2.5   Kitty Litter  Kevyn   January 1
store2   5.0          Spoon  Filip     mid-May

In [176]:
df['Delivered'] = True
df

        Cost Item Purchased   Name        Date  Delivered
store1  22.5         Sponge     MJ  December 1       True
store1   2.5   Kitty Litter  Kevyn   January 1       True
store2   5.0          Spoon  Filip     mid-May       True

In [177]:
df['Feedback'] = ['Positive', None, 'Negative']
df

        Cost Item Purchased   Name        Date  Delivered  Feedback
store1  22.5         Sponge     MJ  December 1       True  Positive
store1   2.5   Kitty Litter  Kevyn   January 1       True      None
store2   5.0          Spoon  Filip     mid-May       True  Negative

In [178]:
adf = df.reset_index()
adf

    index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  store1  22.5         Sponge     MJ  December 1       True  Positive
1  store1   2.5   Kitty Litter  Kevyn   January 1       True      None
2  store2   5.0          Spoon  Filip     mid-May       True  Negative

In [179]:
adf['Date'] = pd.Series({0: 'December 1', 2: 'mid-May'})
adf

    index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  store1  22.5         Sponge     MJ  December 1       True  Positive
1  store1   2.5   Kitty Litter  Kevyn         NaN       True      None
2  store2   5.0          Spoon  Filip     mid-May       True  Negative

In [180]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [181]:
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

In [182]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [183]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [184]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [185]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [186]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [187]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [188]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

# Idiomatic Pandas: Making Code PandorableÂ¶

In [189]:
df = pd.read_csv('train.csv')

In [190]:
df = df[df['Age']==50]
df.set_index(['PassengerId','Survived'], inplace=True)
df.rename(columns={'Pclass': 'class'})

,,class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Survived,,,,,,,,,,
178,0,1,"Isham, Miss. Ann Elizabeth",female,50.0,0,0,PC 17595,28.7125,C49,C
260,1,2,"Parrish, Mrs. (Lutie Davis)",female,50.0,0,1,230433,26.0000,NaN,S
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
435,0,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.9000,E44,S
459,1,2,"Toomey, Miss. Ellen",female,50.0,0,0,F.C.C. 13531,10.5000,NaN,S
483,0,3,"Rouse, Mr. Richard Henry",male,50.0,0,0,A/5 3594,8.0500,NaN,S
527,1,2,"Ridsdale, Miss. Lucy",female,50.0,0,0,W./C. 14258,10.5000,NaN,S
545,0,1,"Douglas, Mr. Walter Donald",male,50.0,1,0,PC 17761,106.4250,C86,C
661,1,1,"Frauenthal, Dr. Henry William",male,50.0,2,0,PC 17611,133.6500,NaN,S
724,0,2,"Hodges, Mr. Henry Price",male,50.0,0,0,250643,13.0000,NaN,S

# Pandas:Scales

In [191]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                  index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'])
df.rename(columns={0: 'Grades'}, inplace=True)
df

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [193]:
rdf = df.reset_index()
rdf

        index Grades
0   excellent     A+
1   excellent      A
2   excellent     A-
3        good     B+
4        good      B
5        good     B-
6          ok     C+
7          ok      C
8          ok     C-
9        poor     D+
10       poor      D

In [194]:
df['Grades'].astype('category').head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): [A, A+, A-, B, ..., C+, C-, D, D+]

In [195]:
grades = df['Grades'].astype('category',
                             categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'],
                             ordered=True)
grades.head()

/home/kadas/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  This is separate from the ipykernel package so we can avoid doing imports until

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): [D < D+ < C- < C ... B+ < A- < A < A+]

In [196]:
df.loc[df['Grades'] == 'A+']

          Grades
excellent     A+

In [197]:
df_test = pd.DataFrame({'A': [1, 2, 3], 'B': [1, 4, 7]})
df_test.isin({'A': [1, 3], 'B': [4, 7, 12]})

       A      B
0   True  False
1  False   True
2   True   True

In [199]:
df.loc[(df['Grades'] == 'A+') & (df['Grades'] == 'D+')]

Empty DataFrame
Columns: [Grades]
Index: []

In [200]:
df.loc[(df['Grades'] == 'A+') | (df['Grades'] == 'D+')]

          Grades
excellent     A+
poor          D+

In [202]:
df.loc[df['Grades'] != 'B+']

          Grades
excellent     A+
excellent      A
excellent     A-
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [204]:
df_test = pd.DataFrame({'A': [1, 2, 3], 'B': [1, 4, 7]})
df_test

   A  B
0  1  1
1  2  4
2  3  7

In [205]:
df_test.loc[~df_test['A'].isin({'A': [1, 3], 'B': [4, 7, 12]})]

   A  B
0  1  1
1  2  4
2  3  7

# Pandas:Date Functionality

In [206]:
pd.Timestamp('9/1/2016 10:05AM')

Timestamp('2016-09-01 10:05:00')

In [207]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [208]:
pd.Period('3/5/2016')

Period('2016-03-05', 'D')

In [209]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'), pd.Timestamp('2016-09-02'), pd.Timestamp('2016-09-03')])
t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [210]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [211]:
t2 = pd.Series(list('def'), [pd.Period('2016-09'), pd.Period('2016-10'), pd.Period('2016-11')])
t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

In [212]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

In [213]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']
ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index = d1, columns=list('ab'))
ts3

               a   b
2 June 2013   37  62
Aug 29, 2014  86  69
2015-06-26    90  19
7/12/16       44  34

In [214]:
ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  37  62
2014-08-29  86  69
2015-06-26  90  19
2016-07-12  44  34

In [216]:
pd.to_datetime('4.7.12', dayfirst=True)

Timestamp('2012-07-04 00:00:00')

In [219]:
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2010')

Timedelta('2194 days 00:00:00')

In [220]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

In [225]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [226]:
df.index.ravel                     #ravel

<bound method Index.ravel of Index(['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok',
       'ok', 'ok', 'poor', 'poor'],
      dtype='object')>